{"Secwepmc of the Secwepmc Nation": {"loc": [51.527017, -120.076953], "info": [{"community": "Adams Lake Indian Band (belongs to the Secwepemc Nation, member of the Shuswap Nation Triabal Council)", "leadership": "Chief LynnKenoras (Duck Chief) election June 26, 2024 every 3 yrs _ Councillors; Jules Brandi, Howard Nordqist, Cory Sampson, Shelley Witzky", "contactPerson": "Lawrence Lewis - Executive Director Main # (250) 679-8841   6453 Hillcrest Road, Chase, BC  V0E 1M0", "contactInfo": "cnord@alib.ca", "protocol": "Celia Nord  - Asistant Tiltle & Rights Coordinator cnord@alib.ca", "about": "The main band office is located on the Sahhaltkum (Sexqeltqin) Indian Reserve #4 located on the western side of Little Shuswap Lake, across from the Village of Chase, BC. The main band offices are spread out over ten administration buildings in the Chase IR4 community.Adams Lake was once a gathering place where neighbors would come to meet, socialize and gather roots, berries and what the earth would provide for them. The shorelines of lakes and rivers have archaeological remains of pit-houses where the Secwepemc people resided in the surrounding premises that are old as nine thousand years’ old.  We are often reminded by the Elders that our people have been here for centuries.  Our main source of economy was fishing, hunting, trapping and gathering berries which all led to developing networks, social and political systems.\n\nIn 1865 agent Douglas for the Crown agreed to setting out reserves for the community.  However, it was not until 1877, that the Joint Reserve Commission allotted seven reserves to our Band, totaling approximately 2,785 hectares.  These were not contiguous, which has always made it difficult to govern and manage the lands.  The seven reserves include: Cstèlen IR #1 (Hustalen) located at the south end of Adams Lake as it outlets into the Adams River.  Sq7em IR #2 (Squaam) situated on the north shore of Squaam Bay, on the west side of Adams River.  Tegwups IR #3 (Toops) is positioned on the west shore of Adams Lake as it outlets into Adams River.  Sexqeltqin IR #4 (Sahhaltkum) which is located on the bank of the South Thompson River just southeast of Little Shuswap Lake.  Stequmwhulpa IR #5 is situated along the southeast shore of Little Shuswap Lake.  Sxwetsmèllp IR #6 (Switsemalph) located on the western limits of the municipality of Salmon Arm.  Sxwetsmèllp IR #7 (Switsemalph) is west of the Salmon River within the City of Salmon Arm, BC.\n\nOur traditional territory includes extensive lands, which in turn include our winter villages and traditional resource harvesting sites.  As a result of inhabiting the traditional territory for so long, many signs of our culture, such as artifacts, spiritual sites, stories, place names and traditions, remain tied to the land.  Much of the territory is presently used or held as fee simple land by First Nation community members, for uses such as farms, ranches, parks, mining activities, timber enterprises, oil and gas exploration and other uses related to transportation, among others.  The steady increase in all of those uses, with a gradual influx of more people has prevented us from accessing many of our traditional sites and has sometimes resulted in damaging or destroying significant cultural sites.  As a result, our young people have been discouraged from continuing traditional activities simply due to the realities of difficult access due to conflicting uses.  \n", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://www.adamslakeband.org", "map": "Secwepmc of the Secwepmc Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/secwepemcdetailLarge.jpg\n", "pronounce": "", "dId": "secwepemc-secwepemcul-ewc"}, {"community": "Secwepmc (suh-Meh-much) of the Secwepmc Nation", "leadership": "Chief Shelly Loring, Councillors; Tina Donald, George Lampreau, Jules Philip, Ron Lampreau Jr., Alison Green, Martha Matthew", "contactPerson": "", "contactInfo": "Office: 250-828-9700", "protocol": "", "about": "The Secwepemc People, known by non natives as the Shuswap, are a Nation of 17 bands occupying the south central part of the Province of British Columbia, Canada. The ancestors of the Secwepemc people have lived in the interior of BC for at least 10,000 years. At the time of contact with Europeans in the late 18th century, the Secwepemc occupied a vast territory ... The Nation was a political alliance that regulated use of the land and resources, and protected the territories of the Shuswap. Although the bands were separate and independent, they were united by a common language - Secwepemctsin - and a similar culture and belief system\" Secwepemc Cultural Education Society.  ", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://shuswapnation.org/   ", "map": "Secwepmc of the Secwepmc Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/secwepemcterritory.gif\n", "pronounce": "Shi-HUEP-muh / She-KWE-pem", "dId": "secwepemc-secwepemcul-ewc"}]}, "Shxwháy Village": {"loc": [49.087557, -121.829723], "info": [{"community": "Aitchelitz Band", "leadership": "Chief Angie Bailey (June 4, 2010) Councillors; John Alphonse George (05/05/1976)  Gordon George (04/11/1994), Leona Sam (02/17/2000)", "contactPerson": "Economic Development contact: Chief angiebailey2010@hotmail.com    ", "contactInfo": "Keri Ardell, Operations and Projects Manager TTML   (604) 792-2404    8150 Aitken Road R.R.1 Sardis, BC  V2R 1A9", "protocol": "Keri Ardell - keri.ardell@ttml.ca", "about": "As a member of the Sto:lo Nation, Aitchelitz both participates in and receives a variety of economic development related services, including land development, research, resource management, and tourism services, through the economic development body, Sto:lo Community Futures. Additionally, Aitchelitz is a member of the Skowkale, Aitchelitz, and Yakweakwioose Lands Office, which handles the intersections between lands and economic development. (detailed history of Sto'Lo Nations see website)", "spread": "Spread 6 (KP 1075 to 1144)", "web": "https://www.stolonation.bc.ca/bands", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "A-che-leets", "dId": ""}, {"community": "Shxwha:y Villiage", "leadership": "Chief Councillor, Robert Gladstone (next election: March 31, 2021)", "contactPerson": "recept@skway.com", "contactInfo": "44680 SCHWEYEY ROAD, CHILLIWACK, BC\nPostal codeV2R 5M5\nPhone(604) 792-9316\nFax(604) 792-9317", "protocol": "", "about": "Long before Western European contact, our ancestors lived in the beautiful Ts’elxweyeqw (Chilliwack River Valley).  Our ancestral homelands were at Sxotsaqel, a village at the head of Chilliwack Lake.  Sxotsaqel means ‘sacred lake’ in Halq’eméylem language.  We have a long history of moving down river and eventually settling at the mouth of the Old Chilliwack River (Skway I.R.#5).  Before settling along the Fraser River where we are today, our ancestors lived at a village called Sxwo:yxweyla, here in Chilliwack.  When the people of this large village disbanded, the “big island” – Shxwhá:y (Skway Reserve) – was one of the locations where we eventually located.  One of the great Stó:lō Chiefs, Harry Edwards, translated the meaning of Shxwhá:y: “a place where they made canoes”. This is our present village site at the outlet of Chilliwack River at its confluence with the Fraser.  It was mainly after the great floods of 1894 and 1948 that Shxwhá:y people began to move permanently away from their Village along the Fraser River, escaping a number of influences flooding, the indian residential school, unemployment, and in most instances choosing to live permanently south of the border.", "spread": "Spread 6 (KP 1075 to 1144)", "web": "https://skway.com/", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "Sh-why", "dId": ""}, {"community": "Skowkale First Nation", "leadership": "Election: March 2025, custom, every 4 yrs\nChief Mark Point\nCouncillor Willy Hall\nCouncillor Teresa Galis\nCouncillor Darcy Paul\nCouncillor Tiffany Silver", "contactPerson": "General Manager\nDay to Day Band Business\nmanager@skowkalefn.com or 604-824-5302", "contactInfo": "     #304 10-7201 Vedder Rd. Chilliwack, BC V2R 4G5     604-858-2716.", "protocol": "General Manager\nmanager@skowkalefn.com", "about": "The community known as Skowkale began as Sq'ewqeyl, altered by the Europeans to be spelled Skulkayn and later Skowkale. In the Halq'emeylem language, Sq'ewqeyl literally means 'going around a turn' but is associated with 'at a bend in the Chilliwack RiverSkowkale is a First Nation community located in the core of the City of Chilliwack in British Columbia. With over 230 people on its membership and over 1,000 living in the community, Skowkale is a progressive and growing community that strives to support itsmembers in a fair and equitable manner.    .\nIndigenous and Northern Affairs Canada lists two reserves for Sq'ewqeyl - I.R.#10 & I.R.11. Today, Sq'ewqeyl totals about 68.4 hectares and shares an additional 64.7 hectares of the Grass Reserve lands with eight (8) neighbouring communities within Chilliwack. It also shares 10.3 hectares of Peqwxe:yles reserve lands in Mission and 23.5 hectares of the Coqualeetza lands with 20 bands in the Sto:lo Nation.  Skowkale First Nation is governed under a Family Representative system. With four (4) main families, there is one (1) Councillor selected through a nomination and election process for each family.  At a nomination meeting, if only one member is nominated to represent a family, they are elected by acclamation. However, if more than one member is nominated to represent a family, the names go on a ballot for the entire electorate to help select the representative.  .", "spread": "Spread 6 (KP 1075 to 1144)", "web": "skowkalefn.com", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "Sko-kale", "dId": ""}, {"community": "Soowahlie First Nation", "leadership": "Chief Brenda Wallace (Next election April 25, 2021)", "contactPerson": "bandmanager@soowahlie.ca", "contactInfo": "604-858-4631    info@soowahlie.ca     4393, Soowahlie Park Ln, Cultus Lake, BC", "protocol": "bandmanager@soowahlie.ca", "about": "The community is descended from two historical peoples: the Chilliwack peoples who immigrated to the Cultus Lake area and the Nooksack-speaking peoples originally living there. Historical tensions between the two groups lingered, despite peace-making efforts like marriage-alliances. Soowahlie was the first Chilliwack settlement. Soowahlie was the motherland of Chilliwack. And all the peoples lived up there. There wasn't any other reserve. In 1864, Sergeant William McColl, under the order of British Columbia Governor James Douglas, created one large reserve for the Chilliwack tribe. Three years later, Chief Commissioner of Lands and Works Joseph Trutch reduced the reserve by 91% and spilt it under smaller nations, including Soowahlie.   Affiliated with Sto:Lo Tribal Council ", "spread": "Spread 6 (KP 1075 to 1144)", "web": "https://soowahlie.ca/", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "Soo-wall-ee", "dId": ""}, {"community": "Squiala First Nation", "leadership": "Chief David Jimmie (Next election: March 31, 2022) - Councillors Allen Jimmie (Next election: March 31, 2021)- Alvin Jimmie (Next election: March 31, 2023)", "contactPerson": "Chief David Jimmie davidjimmie@squiala.com ", "contactInfo": "45005 SQUIALA ROAD, CHILLIWACK, BC\nPostal codeV2P 7Z9\nPhone(604) 792-8300\nFax(604) 792-4522", "protocol": "Chief David Jimmie davidjimmie@squiala.com ", "about": "Squiala First Nation is a member of the Ts'elxweyeqw Tribe located in the Fraser Valley of Southern British Columbia, Canada. Squiala First Nation is composed of two reserves; IR #7 and IR #8. Squiala IR #7 is located on the north-west side of the City of Chilliwack. Squiala IR # 8 is located on the north-east section of Chilliwack Mountain. Squiala is part of the Coast Salish ethno-cultural tribal group and is in the Salishan linguistic group.  How Squiala First Nation was formed?  All members can be traced back to Sam and Theresa Jimmie. Sam and Theresa were the founders of this reserve. Together they had 7 sons and Squiala membership is made up of the descendents from the seven brothers. We are currently in our 6th generation. ", "spread": "Spread 6 (KP 1075 to 1144)", "web": "www.squiala.com", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "Skwye-ala", "dId": ""}, {"community": "Ts'elxweyeqw Tribe Management Limited", "leadership": "Keri Ardell, Operations Manager  keri.ardell@ttml.ca", "contactPerson": "Keri Ardell - Operations and Projects Manager/Project Referrals  keri.ardell@ttml.ca 604-824-2692   reception@ttml.ca", "contactInfo": "7201 Vedder Rd Bldg 8A, Chilliwack, BC V2R 4G5", "protocol": "Keri Ardell - Operations and Projects Manager/Project Referrals  keri.ardell@ttml.ca", "about": "The Ts’elxwéyeqw are the First People of the Chilliwack River Watershed in the Central Fraser Valley of southwestern British Columbia.  Our tribal name, ‘Ts’elxwéyeqw’ is commonly known in English as ‘Chilliwack’.  We are one of the tribes of the Stó:lō (Stah-lo) – People of the River – as our livelihood was very much connected to the Fraser River.  Ts’elxwéyeqw is one of the major river systems of the lower Fraser River Watershed and extends into northwestern Washington State.  We are part of the broader Coast Salish collective whose lands surround the Salish Sea of the North American Pacific Northwest.  Halq’eméylem is the ‘upriver’ dialect of the Halkomelem language spoken by Ts’elxwéyeqw and our relatives between the Fraser Canyon near Yale, throughout the Lower Fraser Valley around Vancouver, and across the Georgia Strait to southeastern Vancouver Island around Nanaimo.  Our Seven First Nations of the Ts’elxwéyeqw Tribe are Ăthelets, Shxwhá:y, Sq’ewqéyl, Sxwoyehálá, Th’ewá:li, Ch’íyáqtel, and Yeqwyeqwí:ws.  The more commonly known ‘anglicized’ versions of these names are: Aitchelitz, Shxwhá:y Village, Skowkale,  Squiala, Soowahlie, Tzeachten and Yakweakwioose, as a result of the creation of our Indian Act Bands and Reserves.  Before the arrival of Europeans in the early 1800’s, we had many more named villages located all along the rivers and creeks of the watershed that carry our tribal name – Ts’elxwéyeqw.", "spread": "Spread 6 (KP 1075 to 1144)", "web": "", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "", "dId": ""}, {"community": "Tzeachten First Nation", "leadership": "Chief Derek Epp (next election: March 31, 2023) every 3 yrs.", "contactPerson": "Chief Derek Epp  derek@tzeachten.ca", "contactInfo": "Phone: 604-858-3888       45855 Promontory Rd, Chilliwack, BC", "protocol": "Deanna Honeyman - Lands Manager deanna@tzeachten.ca", "about": "Tzeachten First Nation became an independent First Nation in the late 1960’s according to the Department of Indian Affairs (DIA). At the time, Tzeachten had a community hall and a sports field, where the current Vedder Crossing Plaza is now located.\nIn 1971, the Tzeachten longhouse was built. This was used for many community events and gatherings but unfortunately it burnt down in 1976. There is currently no longhouse on Tzeachten; however, there is a possibility of building one in the future.\nChilliwack Area Indian Council (CAIC) was formed in 1970 when the local DIA office was closed. CAIC was solely concerned with the provision of services and was the first Stó:lō authority delegated to administer benefits under the health, social assistance and education programs of the DIA.  In 1977, twenty-four First Nations banded together to sign the Stó:lō Declaration and creating Stó:lō Nation (SN).", "spread": "Spread 6 (KP 1075 to 1144)", "web": "https://www.tzeachten.ca/", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "Chak-tun", "dId": ""}, {"community": "Yakweakwioose First Nation", "leadership": "Chief Frank Malloway (elected in 1999)", "contactPerson": "keri Ardell - Project Referrals  keri.ardell@ttml", "contactInfo": "Phone: 604-858-1785         RR2, 7176 Chilliwack River Road, Sardis, BC", "protocol": "keri Ardell - Project Referrals  keri.ardell@ttml.ca ", "about": "Yeqwyeqwí:ws is the proper Halq’eméylem spelling of Yakweakwioose which was altered like most Halq’eméylem words by the Europeans at contact. The size of Yeqwyeqwí:ws, Skowkale and Tzeachten in 1864 was 2,500 acres or 1,012 hectares. In 1867, under Joseph Trutch’s direction, all central Fraser Valley Stó:lō reserves were resurveyed and reduced. Yeqwyeqwí:ws, Skowkale and Tzeachten were reduced to 200 acres or 81 hectares; today there are 914 acres or 370 hectares.\n\nEntire extended families lived in a longhouse, if there were additions to the family and the longhouse became too small, they added on to the longhouse. That’s how the longhouses got so long. Chief Louie described a longhouse along Yeqwyeqwí:ws that was a thousand feet long. It housed a huge family and they stayed here because the fish were plentiful. Bert Louie said, the longhouse that stood there burnt down. The present hereditary Chief Frank Malloway (Siyémches) thinks that it couldn’t have happened that long ago because when he built his “Richard Malloway Memorial Longhouse”, on Yeqwyeqwí:ws reserve, he found 2 inches of black soil, almost like ashes. Longhouse floors were built 4 feet down. That’s where the name Yeqwyeqwí:ws came from “Yeqw: means fire. Yeqwyeqwí:ws means “burned out many times, Yeqwyeqwí:ws is “a site that has been a place of many fires”, sometimes resulting from raids.  We never had “Chiefs” a long time ago, families appointed their family leader through the use of important ancestral names. The Department of Indian Affairs first appointed the “Chiefs” through their Indian Agents and later created the present Chief election system.\n\nSome high status Smelá:lh “Worthy People”+O89 became especially respected and developed a reputation for leadership. Such people were referred to as Siyá:m which implies “unblemished ancestry,” “good manners,” “extra-human support,” and “wealth.” The main leader was called the Yewal Siyá:m. The expression Siyá:m can also be understood as meaning, “respected extended family leader.” The Siyá:m used their extensive knowledge of the territory and its resources along with their extended family relationships to access the wealth of resources. This wealth of resources was given away at potlatches to elevate and maintain their status as Siyá:m.", "spread": "Spread 6 ", "web": "https://www.sxta.bc.ca/sxta-communities/yakweakwioose/", "map": "Shxwháy Village", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tselxwyeqw_tribe_fcrsa_executed_with_bcrs.pdf", "pronounce": "Yak-week-wee-oose", "dId": ""}]}, "Ashcroft Indian Band": {"loc": [50.404267, -120.678195], "info": [{"community": "Ashcroft Indian Band", "leadership": "Chief Greg Blain, next election May 7, 2023 - Councillors; Earl Blain, Dennis Pittman", "contactPerson": "Jodene Blain, Band Administration (250) 453-9154", "contactInfo": "(250) 453-9154   info@ashcroftband.ca    414 Cornwall Rd, Ashcroft, BC V0K 1A0", "protocol": "Jodene Blain, Band Administration  jodene@ashcroftband.ca", "about": "The Ashcroft Indian Band was traditionally known as the Nlaka’pamux. The people of the AIB have lived in this area, along the shores of the Thompson River in the British Columbia Interior for 6000 years. The reserve boundaries were established in the 1880s. More than a century and a half later, the Ashcroft Indian Band fishes in the same river, and remains firm on the same land Nlaka’pamux have occupied for generations and generations. Today the Band has about 270 members, living both on and off reserve.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "http://www.ashcroftband.ca/", "map": "Ashcroft Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/ashcroft_fro_jul06.pdf", "pronounce": "", "dId": ""}]}, "Boothroyd Band": {"loc": [49.963059, -121.484624], "info": [{"community": "Boothroyd Band", "leadership": "Chief Mike Campbell, next election September 30, 2021", "contactPerson": "Chief Mike Campbell", "contactInfo": "Phone: 604-867-9211   Email: boothroydband@gmail.com    PO Box 295, Boston Bar, BC V0K 1C0 (250) 867-9211", "protocol": "Chief Mike Campbell ", "about": "The Boothroyd First Nation is a First Nations government in the Fraser Canyon area of the Central Interior of the Canadian province of British Columbia. Located near Boston Bar, it is a member of the Nlaka'pamux Nation Tribal Council along with the Boston Bar First Nation, also located in Boston Bar, and the Ashcroft First Nation near the town of Ashcroft.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "https://boothroydband.wixsite.com/mysite", "map": "Boothroyd Band", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-nlakapamuxTTM.jpg\n", "pronounce": "", "dId": ""}, {"community": "Shackan Indian Band ", "leadership": "Chief Jordan Joe,    Councillors; Mary Angus, Joan Seymour (next election March 19, 2024 - every 3 yrs)", "contactPerson": "sibchief@shackan.ca", "contactInfo": "PO BOX 1360, 2099 GRANITE AVENUE, MERRITT, BC\nPostal codeV1K 1B8\nPhone(250) 378-5410\nFax(250) 378-5219", "protocol": "", "about": "The Sxe'xn'x (meaning Little Rocks in Sxe'xn'x dialect of the Nlakapamux ) have occupied their territories in the Nicola Valley and surrounding region since time immemorial. Prior to the arrival of non-Natives, the resources of the Nicola Valley were managed by the Nlakapamux to enhance and maintain settlement, food, and medicine gathering, hunting, fishing, horse grazing, fur trapping, and trade. By the year 1857, the Sxe'xn'x had begun to incorporate gold mining and agriculture as new economic strategies.\n\nFollowing non-Native settlement in the Nicola Valley, Indian Reserves were laid out by Indian Reserve Commissioner, Gilbert Sproat, in August 1878. As one of several reserves laid out for the Lower Nicola Indian Band, was created near the Scw'exmx village of \"Kapatci'tcîn\". Sproat described the site as \"Potatoe Gardens\" or \"Skachin\". In the same month, to other reserves near to \"Potatoe Gardens\" were also established: \"Papsilqua [I.R. #13], used for raising hay and as grazing pasture, with access to water for irrigation; and Soldatquo [I.R. #12], used mainly as grazing pasture.\n\nShackan Indian Band and Nooatich Indian Band was formed in the early 1950s after splitting from the Lower Nicola Indian Band.  Affiliated with Scw'exmx Tribal Council ", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://www.shackan.ca/", "map": "Boothroyd Band", "srcTxt": "", "srcLnk": "", "pronounce": "Shah-ken", "dId": ""}, {"community": "Skuppah Indian Band ", "leadership": "Chief Doug McIntyre   Email: dougmc707@yahoo.com", "contactPerson": "Chief Doug McIntyre dougmc707@yahoo.com", "contactInfo": "P.O. Box 548\n988 McIntyre Rd\nLytton, BC V0K 1Z0\nPhone: 250-455-2279\nFax: 250-455-2772\nEmail: dougmc707@yahoo.com", "protocol": "Chief Doug McIntyre dougmc707@yahoo.com", "about": "Skuppah is an ancient place alongside the Fraser River near the fork of the Thompson and Fraser Rivers. It is a member of the Fraser Canyon Indian Administration, one of three tribal councils of the Nlaka'pamux people. With 8 Reserves totaling almost 246 hectares, Skuppah lands are fractured by the Trans Canada Highway, Canada Pacific Railroad, Canadian National Railroad, power transmission lines, and the Fraser River.", "spread": "Spread 5 (KP 806 to 1075)", "web": "", "map": "Boothroyd Band", "srcTxt": "", "srcLnk": "", "pronounce": "Skup-pa", "dId": ""}, {"community": "Spuzzum First Nation", "leadership": "Chief James Hobart (Next election May 4, 2022)", "contactPerson": "Chief James Hobart xaytembear@gmail.com", "contactInfo": "RR#1 Site 3 Comp 11 36500 Main Road, Yale,\nBC, V0K 2S0\nPhone: (604) 863-2395\nFax: (604) 863-2218\nEmail:  spuzzum.fn1@gmail.com", "protocol": "Crystal Anne Hatzidimitriou sdmb@spuzzumnation.com", "about": "Spuzzum Nation is a Nlaka’pamux First Nations government located in Spuzzum. The Nlaka’pamux Nation were semi-nomadic people, meaning they moved around in search of food. Nlaka’pamux First Nations lived in shelters according to travel, weather and subsidence. The First Nation People lived in Pit House communities that were mostly used during the winter months, although some might have been used all year. A Pit House was a shelter built mostly below ground with an entrance and ladder at the top. Several families lived in a Pit House, as most were 8-10 meters in diameter. The First Nation People lived in Lean-to’s as temporary shelters while travelling. Lean-to’s were built to lean against a solid frame, and were intended to be very temporary. Nlaka’pamux First Nations of the Fraser River made their living through seasonal hunting and gathering. They hunted animals such as deer, moose, elk, marmot, black bear and grouse and fished the rivers and creeks for salmon and trout. They also gathered berries, roots, vegetables, mushrooms, bark, and long roots (some for medical benefits). Salmon were prized above all other fish and were the economic, cultural and spiritual focus of First Nations in the Fraser River Basin. Nlaka’pamux First Nations used many unique fishing tools such as weirs, basket traps, dip nets, gill nets and spears to catch sturgeon, trout and salmon.  Nlaka’pamux basket-making is central to Nlaka’pamux cultural identity, embodying women as culture bearers. Their ethno-botanical and technical knowledge has been transferred through female lines for generations, in the making of baskets using traditional motifs. Basket Making is a tangible expression of Nlaka’pamux culture, and it articulates historical memory.", "spread": "Spread 5 (KP 806 to 1075)", "web": "http://www.spuzzumnation.com/", "map": "Boothroyd Band", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-nlakapamuxTTM.jpg\n", "pronounce": "", "dId": ""}]}, "Boston Bar First Nations": {"loc": [49.621761, -120.95154], "info": [{"community": "Boston Bar First Nations", "leadership": "Chief Pamela O'Donaghey, next election July 17, 2023.   Councillors; Yvonne Andrew, Jeremy Campbell, Darren Florence", "contactPerson": "Terry Raymond, Referrals ", "contactInfo": "Phone: 604-867-9317  Email: bbarbandd@uniserve.com     S.S. 1 Boston Bar, BC V0K 1C0", "protocol": "Terry Raymond  tray69770@msn.com", "about": "The Boston Bar First Nation is a First Nations government in the Fraser Canyon region of the Southern Interior of the Canadian province of British Columbia. Located near the town of Boston Bar, it is a member of the Nlaka'pamux Nation Tribal Council, which engages in Natural Resources and Forestry Management efforts.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "", "map": "Boston Bar First Nations", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/bostan_bar_fro_oct06.pdf", "pronounce": "", "dId": ""}]}, "Canim Lake Band": {"loc": [51.770937, -120.993827], "info": [{"community": "Canim Lake Band (The People of Broken Rock \"The Tsq'escenemc\")", "leadership": "Chief Helen Henderson, next election June 06, 2022     ", "contactPerson": "reception@canimlakeband.com", "contactInfo": "Canim Lake Band Office\nP.O. Box 1030\n100 Mile House, BC V0K 2E0     Phone: 250-397-2227", "protocol": "Pam Theodore, Lands Coordinator   landscoordinator@canimlakeband.com", "about": "The Shuswap Nation is part of the Interior Salish People. The Salish People cover the area from the Coast (Coastal Salish) from Northern BC to Washington State to the Cariboo Region. The Tsq’escenemc are part of the lakes people of the Northern Shuswap, using the vast number of lakes in the region to maintain our sustenance.", "spread": "Thompson Country - Spread 4 (KP 610 to 764) ", "web": "http://canimlakeband.com/", "map": "Canim Lake Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/canim_lake_band_fcra_executed_october_1_2018.pdf", "pronounce": "", "dId": ""}]}, "Chawathil First Nation": {"loc": [49.283272, -121.291263], "info": [{"community": "Chawathil First Nation", "leadership": "Chief Rhoda Peters, next election July 14, 2022", "contactPerson": "Chief  rhoda.peters51@gmail.com                    Rose Peters, Manager TTML rose.peters@chawathil.org", "contactInfo": "(Phone) 604-869-9994\n(Fax) 604-869-7614\n4-60814 Lougheed Hwy 7\nHope, BC V0X 1L3\nE-mail: reception@chawathil.org", "protocol": "Rose Peters, Manager TTML rose.peters@chawathil.org", "about": "The Chawathil First Nation are situated in a resplendent mountain setting located in the Fraser Valley 140 km East of Vancouver, BC.  The Chawathil people have lived in our present location for thousands of years.  Our traditional territory once occupied much of what is now Hope and surrounding areas.\nOur natural resources in the territory have sustained our people and way of life for centuries.  We thrive on a communal lifestyle that respects the wisdom of our elders..\nChawathil are Sto:lo people or “river people” who depend upon the river and land for their survival and livelihood.  The Sto:lo share a common language known as Halq’emeylem (Hal-ko-me-lem), of the Coast Salish language family.  The people moved throughout the territory using the resources and land provided for fishing, hunting and gathering, to maintain their livelihood.  Today, the Chawathil people still use these resources for economical and traditional purposes.", "spread": "Lower Mainland  - Spread 7 ", "web": "www.chawathil.org", "map": "Chawathil First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/chawathil_fcrsa_renewal_document_-_2019.pdf", "pronounce": "Shi-wath-il", "dId": ""}]}, "Chiyom Agassiz (Cheam) First Nation": {"loc": [49.540481, -121.7239], "info": [{"community": "Chi:yo:m Agassiz (Cheam) First Nation - meaning \"Wild Strawberry Place\"", "leadership": "Chief Andrew Victor, Councillors; Bruce (BJ), Douglas, Darwin Jason Douglas, John Lincoln Douglas, Stephanie Fredette, Fredick (Rick) Quipp, election November 29, 2021", "contactPerson": "Tammy McLaren, Executive Assistant for Chief and Council   councilexecassist@cheamband.com               Mahyar Niroumand\nLands & Capital Director\nlandsdirector@cheamband.com", "contactInfo": "52161 Victor Drive\nRosedale, BC V0X 1X1                    Ph: 1-604-794-7924", "protocol": "Keri Ardell - keri.ardell@ttml.ca", "about": "The Xwchíyò:m have lived in S’ólh Téméxw for thousands of years. We have never ceded or surrendered title to our lands, rights to our resources, or authority to make decisions within our territory.  Cheam people practice our culture in many ways. The best way to preserve our traditions and culture is by practicing them in our everyday life and teaching them to our children. As fishing is so important to our people here in Cheam, we have been practicing the First Salmon Ceremony for many years. We believe this ceremony is so important for the survival of the fish and to continue feeding our families for generations to come. Another important teaching that we practice is the way we have funerals. There are unwritten laws that we must follow to ensure a safe journey for our loved ones. Along with funerals, we have burnings. There are many significant cultural and traditional events that we practice in our everyday lives such as: dance groups; language classes; arts and crafts; fishing; hunting; singing and drumming; burnings; traditional weddings; ceremonies (naming, memorials, mask and honoring) and medicine harvesting.   Cheam First Nation is a village of the Pilalt tribe of First Nations. Prior to European contact, our village participated with other Pilalt villages in stewarding our lands. Fishing has always been foundational to our people and has influenced our culture and traditions, how we steward our lands and the strong focus we have on protecting the environment. Before contact, the health of our community was strong. We managed our resources and food sources were plentiful.  After European contact, our people became dependent on the Indian Agency. The Federal and Provincial Governments took away our stewardship of the land and many of our systems now are colonized rather than traditional systems. Our systems are underfunded; therefore many of our programs and services are underfunded. That has resulted in poverty, social issues, anger and laws that negatively affect our ability to maintain our cultural and traditional ways.Over the years, we have begun to slowly gain our stewardship of the land back by way of successful court cases. However, we are faced with choices such as continuing to operate under Aboriginal and Northern Development Canada (AANDC), sign a treaty and extinguish our individual rights, or establish some sort of self-government.\n", "spread": "Lower Mainland SW - Spread 7 ", "web": "https://cheam.ca", "map": "Chiyom Agassiz (Cheam) First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/cheam_renewal_executed_fcrsa-2_2015-12-21.pdf", "pronounce": "Chee-am", "dId": ""}]}, "Coldwater First Nation": {"loc": [50.027994, -120.41473], "info": [{"community": "Coldwater First Nation (Nc/etko - the people of the creeks)      ", "leadership": "Chief Terrence Lee Spahan, next election December 4, 2021      Councilors\nMichael Smithers\nAnnie Major\nLarry Antoine\nTracey Aljam\nW. Gerome Garcia\nLeah Collins\nCorrina Manuel\nWendy Hall", "contactPerson": "Laura Antoine - Band Administrator  lantoine@coldwater.org", "contactInfo": "Merritt\nBritish Columbia\nV1K 1B8\nCanada\nPhone: \n250-378-6174\nhttp://www.coldwaterband.com", "protocol": "Laura Antoine - Band Administrator  lantoine@coldwater.org", "about": " We are Interior Salish people who belong to the Nlaka’pamux Nation. We are connected to other Nlaka’pamux communities through shared values, language and ancestry.  Locally, our people are known as C'eletkwmx, and our regional affiliation is with the Scw'exmx, the \"People of the Creeks\".                   History:  They travelled and settled far and wide across the territory that would become the southern interior of British Columbia and northern Washington State.  Rivers, valleys and mountain passes provided “highways” for our people to access the resources they needed to live a good and abundant life. They fished salmon in the rivers and streams, hunted game in the forests, mountains and grasslands, and gathered plants and medicines throughout the territory, all the while trading with neighbouring nations.\n\nOur ancestors lived in pithouses during the winter months, and during the rest of the year, they travelled in family groups across the territory, accessing seasonal resources as they became available. Summer villages were special places where family groups came together to socialize, attend to governance matters, and to share, trade and gather resources. These Nlaka’pamux ancestors enjoyed a rich, complex cultural and spiritual life with teachings that structured social life and governance.  When European settlers arrived in Nlaka’pamux territory in the first half of the 19th century, our ancestors willingly entered into economic relationships with these new neighbours, while incorporating the new technologies and occupations they brought with them into our lives.  By the mid-19th century, the newcomer population had grown exponentially, which in turn resulted in many changes to daily life in Nlaka’pamux communities. Although our ancestors continued to engage in traditional activities on the land, accessing that land became more difficult as settlers put up fences and privatized large areas of our traditional territory.\nIn addition to continuing with their traditional activities, our ancestors adapted to this new way of life and the new rules and regulations about accessing lands and resources that were imposed by colonial governments. During this period, our ancestors took on new livelihoods such as ranching, farming and working on railroad construction.  Today, agriculture and forestry continue to be popular among the members.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "https://www.coldwaterband.com/", "map": "Coldwater First Nation", "srcTxt": "", "srcLnk": "", "pronounce": "", "dId": ""}]}, "Cook's Ferry Indian Band": {"loc": [50.032193, -120.617392], "info": [{"community": "Cook's Ferry Indian Band Kumcheen (Variation Nkumcheen); Includes Pokheistk (Variation Pakeist, Pokheistsk), Pemynoos (Variation Piminos), Spatsum (Variation Spaptsin), Spence'S Bridge", "leadership": "Chief Christine Minnabarriet, next election December 5, 2022", "contactPerson": "Chief Christine Minnabarriet  Christine.Minnabarriet@cooksferry.ca   PO Box 130, Spences Bridge, BC V0K 2L0", "contactInfo": "tel: 250.458.2224\nFax: 250.458.2312\nToll Free: 1.800.707.2263\n\nEmail: reception@cooksferry.ca", "protocol": "Chief Christine Minnabarriet", "about": "The Cook's Ferry First Nation is a Nlaka'pamux First Nations government located in the Central Interior region of the Canadian province of British Columbia. It is a member of the Nicola Tribal Association, which are two of three tribal councils of the Nlaka'pamux people.  The Nlaka’pamux are an Interior Salish Nation. The people\nfrom Cook’s Ferry Indian Band lived, traded, hunted, harvested,\ntraveled, and gathered all over their territory. Spences Bridge,\nwhere the Nkemcin River meets the Thompson River, was an\nimportant traditional place of gathering for trade, governance\ndecisions, inter-tribal meetings, and salmon feasts.\n", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "http://cooksferryband.ca/", "map": "Cook's Ferry Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/cooks_ferry_fcrsa_executed_1may14.pdf", "pronounce": "", "dId": ""}]}, "Cowichan Tribes": {"loc": [48.888822, -123.752153], "info": [{"community": "Cowichan Tribes", "leadership": "Chief William \"Chip\" Seymour - Squtxulenuhw    (next election: December 6, 2021) Councillors; Howie George, Stuart Pagaduan, Graig George, Stephanie Atleo, Calvin Swustus, Jen Charlie, Albie Charlei, Debra Toporowski, Francine Alphonse, Calvin Sr. Swustus, Dora Wilson, Cindy Jane Daniels", "contactPerson": "contactus@cowichantribes.com", "contactInfo": "250-748-3196    5760 Allenby Rd. Duncan, BC V9L 5J1", "protocol": "Natalie Anderson - Referrals Coordinator Natalie.Anderson@cowichantribes.com", "about": "Archaeological evidence dates our existence as far back as 4,500 years, but our historical memory says that we have been here since time immemorial.  While we have evolved into a modern society, many of our cultural practices and traditions have been carried on for generations, and are still woven into our culture today.   We are the Hul’q’umi’num people which means people who speak the Hul’q’umi’num language, and are a part of a larger first nations group referred to as the Coast Salish People.  Cowichan Tribes was part of the Cowichan Nation before the arrival of the Europeans. A people with territory through the shores of the Salish Sea, including the lower Fraser River, the Cowichan Nations was broken up by the government with the creation of the reserve system and imposition of the Indian Act.  Cowichan Tribes was part of the Cowichan Nation before the arrival of the Europeans. A people with territory through the shores of the Salish Sea, including the lower Fraser River, the Cowichan Nations was broken up by the government with the creation of the reserve system and imposition of the Indian Act.  The present -day Cowichan Tribes is the primary sucessor community to the historic Cowichan Nation.  The present-day Stz'uminus (Chemainus), Penelakut, Halalt, Lyackson, and Hwlitsum are also successors to the historic Cowichan Nation.  Now Cowichan Tribes specifically refers to those Cowichan Nation communities who trace their ancestry back to the communities with winter villages on the Cowichan and Koksilah Rivers and Cowichan Bay.   www.cowichantribes.com  ", "spread": "Vancouver Island - Southeastern ", "web": "https://www.cowichantribes.com/", "map": "Cowichan Tribes", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/cowichan_tribes_-_fcrsa.pdf", "pronounce": "Cow-ut-zun", "dId": ""}]}, "Ditidaht First Nation": {"loc": [48.890317, -124.592686], "info": [{"community": "Ditidaht First Nation Formerly Nitinaht (Pre-1984) (Variation Nitinat)", "leadership": "Chief Councillor, Brian Tate, Councillors; Anne Pettet, Paul Sieber, Kelly Sport, Darryl Tate, election July 15, 2023", "contactPerson": "Paul M Sieber, Natural Resource Manager  psieber@ditidaht.ca", "contactInfo": "Council 250-745-3333", "protocol": "Eva Wilson - Administrator / Executive Director  e.wilson@ditidaht.ca\nexecutivedirector@ditidaht.ca", "about": "The present Ditidaht Nation is an alliance of at least ten “local groups” each consisting of a group of people occupying a specific geographical area and centered around chiefs and their families. The local group took its name from the name of its main village’s location. It is likely that these groups were more independent long before the White people came to our shores, but during the time since our history has been recorded in documents, we have been viewed as one people, with one common territory, and one name by which we are all known today. We are Ditidaht, or as we say in our own language, diitiid7aa7tx. Some of us prefer the name da7uu7aa7tx, the name of the original Nitinat Lake people. But today we are best known as the Ditidaht.  ur name for ourselves means ‘people of diitiida,’ as the suffix -aa7tx means ‘people.’ Therefore, when we refer to the names of the individual groups comprising our Ditidaht Nation, we use the name of their original village, plus the suffix ‘people.’ For example, these are the names of some of the original local groups that form the present Ditidaht Nation, and the location of their main village:", "spread": "Vancouver Island", "web": "https://www.nitinaht.com/", "map": "Ditidaht First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/ditidaht_first_nation_fcrsa.pdf", "pronounce": "Dee-tee-dot / Dee-tee-dat", "dId": "ditidaht"}]}, "Esquimalt Nation": {"loc": [48.688573, -123.453132], "info": [{"community": "Esquimalt Nation (Xwsepsum or Kosapsum)", "leadership": "Andrew Thomas, Hereditary Chief (appointed January 14, 2019)  Elected Chief Thomas Robert - 4 year term, next election October 1, 2023", "contactPerson": "Katie Hooper - Executive Director 250-381-7861 Katie@esquimaltnation.ca", "contactInfo": "Phone: 250-386-1043   info@songheesnation.com ", "protocol": "Katie Hooper - Executive Director 250-381-7861 Katie@esquimaltnation.ca", "about": "The Esquimalt Nation is a small nation on the water of Esquimalt harbour.  What is now Victoria used to be shared by five other communities:  the Cheko'nein, the Chilkowetch, the Swenghwung, the Hwyuwmilth, and the Teechamitsa.  We spoke the same language and, to the large extent, shared the bounty the land and and sea had to offer us.   When the British (under James Douglas) arrived in our territories, our ancestors – led by our ancestor Sisunuq and others – greeted him. A treaty signed with Douglas in 1850 – only six generations ago – guaranteed continued access to fishing and hunting, and maintenance of our spiritual relationship with the land, the resources, and our ancestors. However, devastating disease and consistent efforts to assimilate us through land and education policies have exacted a devastating toll on our families.  Despite what the world thinks, we have not lost our culture. ", "spread": "Vancouver Island", "web": "https://www.esquimaltnation.ca/", "map": "Esquimalt Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-esquimaltTTM.png\n", "pronounce": "Ess-KWY-malt", "dId": ""}]}, "Halalt First Nation": {"loc": [48.929783, -124.479846], "info": [{"community": "Halalt First Nation ", "leadership": "James Thomas - next election September 16, 2021", "contactPerson": "Chief James Thomas chief@halalt.org      7973 Chemainus Rd, Chermainus, BC  V0R 1K5", "contactInfo": "250-246-4736", "protocol": "Caroline Gladstone director@halalt.org", "about": "The Halalt originate from the village of xeláltxw, which means ‘marked houses’ or ‘painted houses’, a reference to the fact that the houseposts in this village were decorated. According to information collected by Rozen (1985), this village was once located in the Cowichan Valley, at the spot where the Silver Bridge currently crosses the Cowichan River, at the south-eastern edge of the city of Duncan. According to Cowichan oral history, the forefathers of both the Cowichan and Chemainus people (Siyóletse and St’éts’en respectively) originated from this village. The residents of this village later relocated to a village at the north end of Willy Island, the largest of the Shoal Islands located just off the mouth of the Chemainus River, perhaps in the early part of the 19th Century. When they moved, they took the village name with them. Rozen (1985) reports that, historically, there were at least five or six houses in the village in Willy Island. Although the entire island was designated an Indian Reserve (Halalt Island No. 1), the village was abandoned in the 1920s and the residents moved to the Westholme reserve on the lower Chemainus River (Halalt No. 2).", "spread": "Vancouver Island - Southeastern ", "web": "https://halalt.org/", "map": "Halalt First Nation", "srcTxt": "", "srcLnk": "", "pronounce": "Ha-lalt", "dId": ""}]}, "Heiltsuk First Nation": {"loc": [52.337794, -127.826237], "info": [{"community": "Heiltsuk First Nation", "leadership": "Marilyn Slett (August 9, 2022 every 4 yrs) Councillors; Denise Carpenter, Travis Hall, Jamie Harris, Jess Housty, Howard Hunt (August 9, 2022) Alya Brown, Louisa Housty Jones, Leona Humchitt, Megan Humhitt, Reginald Moody-Humchitt, Lorena White", "contactPerson": "", "contactInfo": "250-957-2381", "protocol": "", "about": "Originally our ancestors occupied more than 50 major villages spread across our vast territory. They used the intricate network of waterways to travel from well-established winter villages to numerous seasonal camps situated on salmon streams, along ancient trading routes, and on far-flung outer islands. When Europeans arrived in the eighteenth century there were several Heiltsuk villages on the various islands near the present-day location of Bella Bella. In 1833 the Hudson’s Bay Company established Fort McLoughlin, a heavily fortified fur trading post, on what is now McLoughlin Bay on Campbell Island. The Heiltsuk already had a well-established trading network on the coast, but the Hudson’s Bay Company sought to supplant indigenous people as middlemen in the the fur trade wherever possible. Still, the officers at Fort McLoughlin found the Heiltsuk would not allow themselves to be pushed aside.\n\nDespite initial hostilities, within a few years a new Heiltsuk village was established in close proximity to Fort McLoughlin. The Heiltsuk became well known as skilled and savvy traders and developed a lucrative, if uneasy, business relationship with the fort. The Heiltsuk knew the village as ’Qélc, but Europeans recorded various other names for the village, perhaps derived from the local geographical namePélbála, that eventually gave rise to the modern English name Bella Bella. Members of Heiltsuk-speaking tribes from across the region who gradually relocated to the village over the next sixty years became known as the Bella Bella Indians. When Fort McLoughlin closed in 1843 the site was abandoned by Europeans. The village of ’Qélc remained and the Heiltsuk continued to trade with the steamship-based trading system that replaced the fort.\n\nIn the winter of 1862-3 a devastating smallpox epidemic took a massive toll on the Heiltsuk population across our territory. Many villages were wiped out entirely, and most others didn’t have enough people left to sustain them. Survivors from the various Heiltsuk tribes gradually amalgamated at Bella Bella, which is centrally located in Heiltsuk territory.\n\nIn 1866 European traders reoccupied the fort site at McLoughlin Bay and established a small store and a post office. Then, in 1880, Bella Bella (’Qélc) became the focus of Methodist mission work on the central coast. The villagers were encouraged to abandon their traditional bighouses and seasonal camps in favour of European-style houses. However, because most of the suitable building area on McLoughlin Bay was “claimed” by the Hudson’s Bay Company, there was a scarcity of land on which to build such houses. By the turn of the century most of the greatly diminished Heiltsuk population resided in Bella Bella (’Qélc), which had become crowded.\n\nIn 1897 the Heiltsuk, making the decision to move, surveyed a new town site three kilometres north of McLoughlin Bay. This place was known to the Heiltsuk as Wáglísla (meaning “river on the beach”). Building progressed quickly and by 1900 the people of ’Qélc had relocated to the new village, which boasted large European-style houses and Heiltsuk-run businesses. This new community was called New Bella Bella.\n\nFor a time the prosperous new Heiltsuk village was a busy centre of trading and shipping activities on the coast. Within a decade the village was the second largest on the coast, with a hospital, school, sawmill, fire hall, wharf, warehouse, and planked roads with street lights. Residents contributed to, and shared in, the success of nearby ventures like Ocean Falls and Namu.\n\nIn 1914 a cannery was built on Denny Island. The store and post office at McLoughlin Bay were moved to the small town that grew around the cannery. Along with the post office went the name “Bella Bella”, which was inherited by the new Denny Island settlement, giving rise to a confusion of names that persists today.\n\nAs the century progressed, diminishing resources and the decreasing dependence of industry on remote communities caused New Bella Bella’s existence to become more isolated and precarious. Ocean Falls and Namu eventually became ghost towns and the cannery on Denny Island fell into ruin. The community on Denny Island relocated to nearby Kliktsoatli Harbour, where an airstrip was built in WWII, becoming Shearwater.\n\nBut New Bella Bella (Waglisla) was revitalized by the building of an airport and BC Ferries terminal and continued to grow and prosper. Today this vital, contemporary community is simply called Bella Bella.\n\nToday the ’Qélc village site, all but disappeared, is known as Old Bella Bella or Old Town. McLoughlin Bay, connected now by road to Bella Bella, is the site of the BC Ferries terminal, a Heiltsuk fish processing plant, and a salmon hatchery. The old Hudson’s Bay Company land is now owned by the Heiltsuk.", "spread": "Vancouver Island", "web": "http://www.heiltsuknation.ca/", "map": "Heiltsuk First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/heiltsuk_fcrsa_signed.pdf", "pronounce": "HAIL-tsuk", "dId": "heiltsuk"}]}, "Huu-ay-aht First Nations": {"loc": [48.833479, -124.929585], "info": [{"community": "Huu-ay-aht First Nation ", "leadership": "Chief Councillor Robert Dennis SR, next election June 17, 2023", "contactPerson": "Mark Stephens - Chief Administrative Officer cao@maanulth.ca", "contactInfo": "250-728-3414", "protocol": "Mark Stephens - Chief Administrative Officer cao@maanulth.ca", "about": "Fundamental to understanding our culture is the concept of the Ḥaw̓iiḥ and the hahoulthee. The Ḥaw̓iiḥ (chiefs) are responsible for the welfare and well being of their hereditary lands, the hahoulthee (chiefly territories), and for the extended families of which they are leaders. The current Tayii Ḥaw̓ił (head chief) of the Huu-ay-aht is Tl’iisin, Chief Derek Peters.  In the Huu-ay-aht way, these carvings represent all our Ḥaw̓iiḥ and ancestors, and portray many things. These first ancestors reflect our history, and embody the ancient and strong connections that exist between the Huu-ay-aht and all of nature. Huu-ay-aht stories tell of how the spirits of humans are still closely related to the spirits of many other creatures.", "spread": "Vancouver Island ", "web": "https://huuayaht.org/", "map": "Huu-ay-aht First Nations", "srcTxt": "", "srcLnk": "", "pronounce": "Hoo-EYE-at / Hoo-AY-at", "dId": ""}]}, "Katzie First Nation": {"loc": [49.557619, -122.607872], "info": [{"community": "Katzie First Nation", "leadership": "Chief Grace George (next election March 31, 2022)", "contactPerson": "Kimberly Armour - Referrals Manager  landopsreferrals@katzie.ca", "contactInfo": "604-445-2564     10946 Katzie Road, Pitt Meadows, BC  V3Y 2G6", "protocol": "Kimberly Armour - Referrals Manager  landopsreferrals@katzie.ca", "about": "Katzie First Nation provides the band government for those living in the Pitt and Alouette watersheds; these people were historically linked with the Musqueam, the Kwantlen and the Nicomekl, so it was a large family of nations covering a good-sized portion of south-western B.C.  Long before the emergence of any other human community in the lower Fraser region, the Creator placed five communities, each with its own chief, at different locations on the land. Those locations are now known as Pitt lake, Sheridan Hill, Port Hammond, Point Roberts and Point Grey. The Katzie people are the direct descendants of these first people; the people that came to be known as the Katzie people descend primarily from Oe'lecten and his people, created at the south shore of Pitt Lake, and Swaneset and his people, created at Sheridan Hill.\n\nDuring these first days after the arrival of human beings, there were few trees, and although there were clams and mussels in the rivers and along the seashore, there was no wind and there were no birds, land animals, sturgeon, salmon, oolichan or sea lions. But the Creator gave these first five leaders gifts and powers to bequeath to those that followed after them. When he placed Swaneset on the earth, the Creator provided the sun and the moon. For Oe'lecten, the Creator provided the seasons and the rainbow.\n\nOe'lecten was then granted a wife, and their children became the sturgeon and a white bird that can only be seen by Oe'lecten's descendants. Oe'lecten's people first settled in villages at Fox Creek, Widgeon Creek at the southwest corner of Pitt Lake, a village occupied until recently, presently known as Katzie I.R. 4.\n\nSwaneset, honouring the Creator's instructions to finish making the territory surrounding the place he had been set down on earth, reshaped the land in order to make it abundant in berry and root crops. Standing on the peak of Sheridan Hill, which was once the highest mountain in the territory, Swaneset called on the help of the Creator, and made Sturgeon Slough and its tributaries. He then made the Alouette River and other sloughs, including Katzie Slough. Swaneset then named all these waterways, and named the river now known as the Fraser. After a time, Swaneset travelled to the sky, and returned to earth with a wife, setting down again on the peak of Sheridan Hill. From the pieces of Sheridan Hill, Swaneset created many of the distinctive hills that mark the countryside between the Fraser River and Pitt Lake. When Swaneset had finished reshaping the land to make it more abundant for his people, he then instructed all his people to gather at Katzie to make homes for themselves here, in the vicinity of the present Pitt Meadows reserve. There, on the banks of the Fraser River, his sky-born wife opened her dowry box, and ushered oolichan and seagulls into this world, and she taught the people how to catch the fish and prepare them. for additional info.    eire.ca/history/heritage/hist1.html", "spread": "Spread 6 (KP 1075.1 to 1144.480)", "web": "", "map": "Katzie First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/katzie_fcrsa_renewal_2-years_term_executed_sep_15_2020.pdf", "pronounce": "KUT-zee", "dId": "katzie"}]}, "Kwantlen First Nation": {"loc": [49.476845, -122.296959], "info": [{"community": "Kwantlen First Nation (tireless Runner)", "leadership": "Chief Marilyn Gabriel (November 30, 1993) Councillors; Leslie Antone, Tumia Knott", "contactPerson": "Economic Development contact: Brenda Fernie, VP, Seyem Qwantlen Business Group (604) 888-5556 info@seyemqwantlen.ca", "contactInfo": "Office: (604) 888-2488   Tumia Knott, Lands, Resources and stewardship", "protocol": "Ashley Doyle - Land and Resource Manager  ashley@kwantlenlands.ca", "about": "Since time immemorial, we live by the seven traditional laws that guided our ancestors: health, happiness, generations, generosity, humbleness, forgiveness and understanding. Through learning, family, health, our culture and traditions and looking after our lands and resources, we are tireless in our spirit to make a better world for our future generations. In working together and learning from our Elders, we are respectful, proud, independent and responsible. Kwantlen translates to tireless runner. Following our rich legacy and traditions, we continue to work tirelessly at building a strong sense of community within our traditional territory. Kwantlen First Nation is committed to environmental sustainability that preserves our natural resources for generations to come. seyem manages the ongoing and growing business activities related to lands, resources, and economic development, and is a limited partnership of Kwantlen First Nation.", "spread": "Lower Mainland - Spread 7", "web": "https://www.kwantlenfn.ca/", "map": "Kwantlen First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/kwantlen_fcrsa_executed_june_20_2019.pdf", "pronounce": "", "dId": "kwantlen"}]}, "Kwaw-Kwaw-Aplit First Nations": {"loc": [49.516226, -121.756432], "info": [{"community": "Kwaw -Kwaw-Aplit First Nations ", "leadership": "Chief Randy Leon August 24, 2022", "contactPerson": "manager@skowkalefn.com", "contactInfo": "604-845-7201", "protocol": "Keri Ardell -Operations and Projects Manager, TTML keri.ardell@ttml.ca", "about": "Kwaw-kwaw-Apilt is a band government of the Sto:lo people located in the Upper Fraser Valley region near Chilliwack. As a member of the Sto:lo Nation, Kwaw-kwaw-a-pilt both participates in and receives a variety of economic development related services, including land development, research, resource management, and tourism services. Kwaw-kwaw-a-pilt is engaged with the Provincial Government through several economic development related agreements, including a Consultation and Revenue Sharing Agreement, as well as a Strategic Engagement Agreement.", "spread": "Lower Mainland - Spread 7", "web": "", "map": "Kwaw-Kwaw-Aplit First Nations", "srcTxt": "", "srcLnk": "", "pronounce": "Kwa-kwa-a-pilt", "dId": ""}]}, "Kwikwetlem First Nation": {"loc": [49.451741, -122.657791], "info": [{"community": "Kwikwetlem First Nation", "leadership": "Chief Councillor Ed Hall (Next election: April 29, 2023)", "contactPerson": "Sarah Prien - Referrals Coordinator referrals@kwikwetlem.com", "contactInfo": "Office: (604) 540-0680", "protocol": "Robert Corman - Director Lands and Resources robert@kwikwetlem.com", "about": "The name Kwikwetlem applies to our people, our lands, and the river and lake at the heart of our traditional territory.  Kwikwetlem refers to a “small red salmon” or unique sockeye salmon that once ran in large numbers in Coquitlam River and Coquitlam Lake.  We take our name from this forebearer that sustained our community for thousands of years. \n\nKwikwetlem people have long lived along the Fraser and Coquitlam rivers.    Today, our community members reside on two reserves located at the ancient village sites of slakəya’nc  (Coquitlam I.R. 1) near the confluence of the Coquitlam and Fraser Rivers, and setłama’kmən (Coquitlam I.R. 2 ) about 2 km further up the Coquitlam River.\n\nOur community has experienced dramatic changes over several generations, but we have always held and respected our own unique history, stories, culture and identity, and have always occupied our lands in and around the Coquitlam watershed. \n\nWe are guided by the teachings of our Elders to respect, care for, and protect our community, our culture, and our lands, waters, and resources for past, present and future generations. Our culture and heritage are the legacy of our ancestors, and are what defines and unites us as Kwikwetlem people.\n\nDozens of known archaeological sites throughout our territory serve as a physical record of our ancient lifeways. Hundreds more archaeological sites remain undocumented, and we are actively engaged in the identification, management, and protection of these irreplaceable cultural records. Our community also possesses rich traditional knowledge passed generation to generation that tell our stories, describe place names, spirit places, trails and travel routes, resource locations and activities, cultural narratives, genealogies, inherited traditional names, songs, and much more. Together, traditional knowledge and archaeological sites convey the story of Kwikwetlem, our ancestors, and our place in a changing world. We take an active role in the protection, management, and celebration of Kwikwetlem traditional use and archaeological resources. \n\nKwikwetlem are proud hən̓q̓əmin̓əm̓-speaking (downriver Halkomelem) Coast Salish people. We descend from a tradition of Elders who were renowned as spirit and winter dancers, skilled canoe builders, and master sturgeon and salmon fishers.\n\nLike all Salish Nations, we recognize our own leaders, hold sacred hereditary knowledge, host community gatherings, value traditional customs of esteemed behaviour, and recognize stories and legends that link us to the natural places and cultural landscapes of our territory. As in the past, we sustain our community and territory by hunting, fishing, gathering, and caring for all the resources of our territory.", "spread": "Lower Mainland - Spread 7 ", "web": "https://kwikwetlem.com/", "map": "Kwikwetlem First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/kwikwetlem_fcrsa_april_30_2015_executed.pdf", "pronounce": "Kway-quit-lum", "dId": "kwikwetlem"}]}, "Leq'amel First Nation": {"loc": [49.348358, -122.106774], "info": [{"community": "Leq' a: mel First Nation", "leadership": "Chief Alice Thompson (next election: March 31, 2024) ", "contactPerson": "Tannis Tommy - Natural Resources Manager tannis@leqamel.ca", "contactInfo": "43101 LEQ'A: MEL WAY, DEROCHE, BC\nPostal codeV0M 1G0\nPhone(604) 826-7976\n\nWeb Site: Leq'á:mel First Nation", "protocol": "Tannis Tommy - Natural Resources Manager tannis@leqamel.ca", "about": "Leq’á:mel, meaning the level place where people meet, was once one of the most popular trading stops in Stó:lō territory. It was also said to have been the birthplace of Halq’eméylem; the word itself stems from the dialect spoken by the Nicoamen/ Leq’á:mel. Leq’á:mel was home to many of the longhouses, some recorded almost a kilometer long. Historically our affiliates were the Sumas, Scowlitz, Matsqui and Nooksack tribes. Leq’á:mel sits on the borderline of the Upper/Lower river dialects of the language, hence the translation of Leq’á:mel from Nicoamen. Our ancestors built longhouses where entire extended families all lived together - from great grandparents to babies. Research suggests that each village had its own siyá:m or respected leader, and it appears that a traditional approach to leadership was determined by family systems. ", "spread": "Lower Mainland - Spread 7", "web": "http://leqamel.ca/", "map": "Leq'amel First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/leqamel_fcrsa_renewal_1_year_term_executed_jan_13_2021.pdf", "pronounce": "La-camel", "dId": ""}]}, "Little Shuswap Lake Indian Band": {"loc": [51.287872, -118.990533], "info": [{"community": "Little Shuswap Lake Indian Band (Skwlax meaning \"Black Bear\")", "leadership": "Chief Oliver Arnouse (next election: July 2, 2021)", "contactPerson": "Territorial Resource Stewardship Department (TRS)  Consultation Officer", "contactInfo": "Office: (250) 679-3203 ext 147  referrals@lslib.com", "protocol": "Warren Fortier wfortier@lslib.com", "about": "To the people of the Little Shuswap, this land is known as Skwlax. The settlers could not say the Shuswap name so it is known today as Squilax. Skwlax in the Shuswap language means black bear.\n\nThe Little Shuswap is also traditionally known as Skwlax, which translates to Black Bear in Secwepemcstin, the traditional language. Each First Nation community has its own symbol that has deep meaning to the ancestry. Though there are different symbols and names for the once thirty two Bands, (now seventeen) that make up the Secwepemc Nation.\n\nA limited amount of hunting on the reservation has preserved the abundance of wildlife in their pristine environment. This is our home for the short time that we are here on Mother Earth, but it is the home of the great spirit for eternity.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "https://www.lslb.ca/", "map": "Little Shuswap Lake Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/little_shuswap_lake_indian_band_-_fcrsa.pdf", "pronounce": "", "dId": ""}]}, "Lheidli Tenneh First Nation": {"loc": [53.944696, -121.694171], "info": [{"community": "Lheidli T'enneh First Nation", "leadership": "Chief Clayton Pountney (next election April 11, 2021)", "contactPerson": "Chus Natlo Sam is the Lheidli T'enneh Natural Resource Referrals Manager ", "contactInfo": "250-562-0847 ext.201  csam@lheidli.ca     150 Brunswick St., Prince George BC, V2L 3B5 ", "protocol": "Chus Natlo Sam - Natural Resource Referrals Manager ", "about": "The Lheidli T’enneh (historically known as the Fort George Indian Band) is a community that is built on and around the strength of its people.  T’enneh literally means “The People”.  For details about time history see lheidli.ca/about/our-history", "spread": "Spread 3 (KP 489 to 610) ", "web": "https://www.lheidli.ca/index.html", "map": "Lheidli Tenneh First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/lhedili_tenneh_direct_award_ima_26feb03.pdf", "pronounce": "Klate-lee Ten-eh", "dId": ""}]}, "Lhtako Dene Nation": {"loc": [52.953049, -122.449172], "info": [{"community": "Lhtako Dene Nation", "leadership": "Chief Cliff Lebrun, councillors; Wanda Aldred, Ray Alfred, Tim Michell, March 22, 2022", "contactPerson": "Jean Christier, Lands and Natural Resources Manager   ", "contactInfo": "250-747-2900 Ext. 306  jean@lhtako.com        reception@lhtako.ca        1515 Arbutus Rd. Quesnel, BC  V2J 5H8", "protocol": "Jean Christie jean@lhtako.com", "about": "The Lhtako Dene Nation is part of the Dakehl (or Southern Carrier) Nation in the Athapaskan language group. Our main community is currently located just south of Quesnel.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "http://carrierchilcotin.org/lhtako-dene-nation/", "map": "Lhtako Dene Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/lhtako_fcrsa_executed_april_162018.pdf", "pronounce": "", "dId": ""}]}, "Lower Nicola Indian Band": {"loc": [50.006984, -121.261538], "info": [{"community": "Lower Nicola Indian Band -", "leadership": "Chief Stuart Jackson (next election: September 30, 2022)", "contactPerson": "Monica Charters - Administrative Assistant fileclerk@lnib.net", "contactInfo": "181 Nawishaskin Lane\nMerritt, British Columbia\nV1K 0A7\nPhone: 250-378-5157", "protocol": "Leesa Mike - Director of Lands and Economic Development leesa.mike@lnib.net", "about": "The Lower Nicola Indian Band (LNIB), the Scw’exmx (the People of the Creeks), is one of the communities of the Nle?kepmx Nation, (Interior Salish ) which has lived for thousands of years in the Nicola Valley and Thompson River system in southern British Columbia. Today, many Lower Nicola community members carry out traditional activities, particularly berry and mushroom picking, fishing and hunting, and working to revive the language and the roots of its culture, N’lakapamux cin, alive and well.  The Nłeʔkepmxc Nation (pronounced Ng-khla-kap-muhx) is one of the Interior Salish first peoples in the Southern interior of British Columbia, along with the Secwe̓pemc (Shuswap), Lillooet, and Okanagan. The word “Nłeʔkepmxc” means “People of the Canyon”.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "https://www.lnib.net/", "map": "Lower Nicola Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/rsa_lower_nicola_band.pdf", "pronounce": "", "dId": ""}]}, "LowerSimilkameen598": {"loc": [49.845148, -118.987733], "info": [{"community": "Lower Similkameen #598", "leadership": "Chief Keith Crow next election December 6, 2021, Councillor Janet Terbasket December 6, 2021, Councillors; Ira Edward, John Louie November 04, 2023", "contactPerson": "Greg Gabriel, Interim Band Manager", "contactInfo": "Phone: 250-499-5528", "protocol": "Nicole Mack - Title and Rights/Natural Resources Department Team Lead nicole.mack@lsib.net", "about": "The Similkameen people have a history with the land that spans thousands of years in what is now Washington State and the Province of British Columbia. The Similkameen People were originally a nomadic people that moved from location to location, mainly due to the ever changing availability of foods and climates. There were certain criteria that had to be met, for an encampment or village site to be located. The potential areas had to have Look-Out Points, Nearby Food and Water Sources, Wood Availability, and Hunting Grounds .\nThe original Native Encampment in the Keremeos area was located where Bear’s Fruit Stand now presides.\n\nThe population of this encampment has been estimated to be between 800 – 1000 people.  This encampment had a good water supply, had good look-out points, and was easily defended.  There was another encampment located nearby, at what is now the Rocking Chair Ranch.  This encampment had an estimated 500 people living there.  They had a fresh-water spring, that provided an excellent source of water.  Also at this location, was a plentiful supply of reeds and tulies.\n\nBefore and upon Contact with Non-Natives, the Dwellings that the Similkameen people stayed in consisted of Pit Houses, Tulie Shelters, Ntamlken Lodges, and Winter Kickwillies.  Pit Houses were made of wood and hemp.  Tulie Shelters were made of reeds, wood and hemp.  Ntamlken Lodges were made with reeds, wood and hemp rope.  Summer Lodges were made of poles and fir boughs.  Winter Kickwillies were made of poles, grass, bark, tulies, and skins of animals.\n\nOriginally, the Similkameen people had a social structure which was governed by a line of Hereditary Chiefs within the greater community.  Each village was led by a Chief that cared for the particular needs of that village.  Advisors known as Wise/Good Men and Women assisted the Chiefs with the difficult decisions that had to be made.\n\nPrior to Contact with Non-Natives, the Similkameen people would gather seasonally to trade goods with Neighbouring Tribes.  Depending on which season it was, the locations would vary.  At these different sites, thenumber of people that gathered to trade could number anywhere from 2000 – 5000 people.  At these trading sites, sometimes the different tribes would compete in games as a form of social gathering and also to demonstrate their strength as a people.\n\nThe coming of Non-Natives to the Similkameen can be mainly attributed to the expansion of the Hudson’s Bay Trading Company, not to mention Missionaries that were sent to live amongst the native population.  Sometime after this, more Non-Natives settled in the Similkameen area during the Gold Rush.\n", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "", "map": "LowerSimilkameen598", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/lsib_signed_fcrsa_minister_signed_july_12_2019.pdf", "pronounce": "Si-MIL-kuh-meen", "dId": ""}]}, "Lyackson First Nation": {"loc": [48.941803, -123.490134], "info": [{"community": "Lyackson First Nation", "leadership": "Chief Pahalicktun (Richard Thomas) appointed by the late Hereditary Chief Gordon Thomas 1993", "contactPerson": "Shannon Gammie, Director of Operations  directorofoperations@lyackson.bc.ca", "contactInfo": "Lyackson First Nation\n7973A Chemainus Road\nChemainus, BC, V0R 1K5\nTelephone: (250) 246-5019\nToll Free: 1-888-592-5766\nFax: (250) 246-5049", "protocol": "Karyn Scott - Consultation Coordinator  consultations@Lyackson.bc.ca\n", "about": "The Lyackson Homeland is Valdes Island. Our community descends from four main ancestors – Thi’Xvulece , Swin’yleth , Swute’se’Dick , and Shulqvilum – who traditionally settled the winter villages of T’a’at’ka7 , Th’a’ x el and Th’ x we’ksen , – located, respectively, at Shingle Point, Cardale Point and Porlier Pass on Valdes Island. Valdes Island is our ancestral territory and we currently manage three land reserves which comprise a third of Valdes Island, where we continue to engage traditional land-use practices on a seasonal basis. Our People speak Island Hul’q’umi’num, of which there are 3 dialects (up river/down river/island). Out of 5700 Hul’q’umi’num people on Vancouver Island, about 100 fluent speakers of the Hul’q’umi’num language are alive.", "spread": "", "web": "http://lyackson.bc.ca/", "map": "Lyackson First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/lyackson_fcrsa_april_9_2018.pdf", "pronounce": "Lay-ik-sen", "dId": ""}]}, "Malahat First Nation": {"loc": [48.655944, -124.000524], "info": [{"community": "Malahat First Nation", "leadership": "Chief George Harry - 4 year term - next election June 12, 2023", "contactPerson": "Josh Handysides - Chief Administrative Officer josh.Handysides@malahatnation.com", "contactInfo": "Phone: 250-743-3231", "protocol": "Josh Handysides - Chief Administrative Officer josh.Handysides@malahatnation.com", "about": "We are the Malahat for which this region is named. Malahat Nation is a proud Coast Salish Indigenous community and one of the five W̱SÁNEĆ (Saanich) Nations. The Malahat First Nation is a member nation of the Naut'sa mawt Tribal Council and was the ninth First Nation in Canada to be certified by the First Nations Financial Management Board. Malahat Nation is a marine-based Nation with a strong tradition of Canoes. The ancestral languages of Malahat Nation are Hul̓q̓umín̓um̓ and SENĆOŦEN. Nation members have family ties with the WSÁNEĆ peoples of the Saanich Peninsula and with members of the modern Hul’q’umi’num Treaty Group. \n\nThe word “WSÁNEĆ” means “emerging land” or “emerging people”—harking back to the great flood of ancient times—and was anglicized to “Saanich” by European settlers.  Prior to European contact, the WSÁNEĆ ancestors of the modern Malahat, Pauquachin, Tsartlip, Tseycum and Tsawout Nations owned and occupied several village sites and resource areas within a large traditional territory that included the Saanich Peninsula; the western shores of the Saanich Inlet from Goldstream to Hatch Point; the Gulf Islands; the San Juan Islands; and surrounding areas.  Together they formed one of the largest population groups on Vancouver Island.  The WSÁNEĆ people spoke SENĆOŦEN, Hul’q’umi’num’ and Samish. The name “Malahat” comes from the SENĆOŦEN word “MÁLEXEȽ” and Hul’q’umi’num’ word “Ma’le-‘h’xe’l’”, both of which are derived from the words for “caterpillars,” a reference to a historic infestation in the area.  ", "spread": "Island Community South", "web": "https://malahatnation.com/", "map": "Malahat First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/malahat_nation_minister_oct_2019_signed_fcrsa.pdf", "pronounce": "Malah-hat", "dId": ""}]}, "Matsqui First Nation": {"loc": [49.290611, -122.361868], "info": [{"community": "Matsqui First Nation", "leadership": "Chief Alice McKay (Next election June 30, 2022)", "contactPerson": "Band Office - matsquiband@shaw.ca  ", "contactInfo": "PO BOX 10, MATSQUI, BC\nPostal code V4X 3R2\nPhone(604) 826-6145", "protocol": "Brenda Morgan - MFN Lands Governance Director  brenda.morgan@shaw.ca   ", "about": "The Matsqui people are a Sto:lo Aboriginal group located in the Central Fraser Valley region of British Columbia, Canada. Their band government is the Matsqui First Nation, a member of the Sto:lo Nation tribal council. The core traditional territory of the Matsqui stretches along the Fraser River from Crescent Island to Sumas Mountain, and southward beyond the Canada-United States border. Today the band administers four reserves and has a population of 225 (which has been steadily growing over recent decades). Ancient legendary stories (known as sxwõxwiyám in the Halq'eméylem language) reveal the ancestors of the current Matsqui people to have occupied Matsqui territory from time immemorial. Like other Sto:lo communities, the Matsqui collectively inherited traits (or \"gifts\") from their shared legendary ancestors. Sto:lo sxwõxwiyám describe how the Matsqui tribe was founded by a man named Sk-Elê'yitl who, along with his son, was transformed into Beaver by Xá:ls the legendary transformer. Beaver was responsible for ensuring that the sockeye salmon were available to all of the Sto:lo communities on the Fraser River, and was the first to bring fire to the Sto:lo people.\n\nThe Matsqui are closely related to the Nooksack people in Washington, and are notable as one of only two Sto:lo groups that were historically bilingual in the Halq'eméylem and Noocksack languages. Their bilingualism has much to do with the nature of Matsqui territory, which features a system of trails, streams, and lakes that connect the Fraser River to the Nooksack River in Washington. The word \"Matsqui\" (Máthxwi) itself may be derived from máth, a root plant that grew in the large, easily traveled marshes that were once abundant in the Matsqui Prairie area.", "spread": "Lower Mainland - Spread 7 ", "web": "", "map": "Matsqui First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/matsqui_fcrsa_renewal_2016-08-04_executed.pdf", "pronounce": "Mat-squee", "dId": ""}]}, "Musqueam Indian Band": {"loc": [49.353225, -123.012956], "info": [{"community": "Musqeam Indian Band", "leadership": "Chief Wayne Sparrow (Next election Nov 30, 2024)", "contactPerson": "Chief Wayne Sparrow chief.wsparrow@musqueam.bc.ca", "contactInfo": "6735 SALISH DRIVE, VANCOUVER, BC\nPostal code V6N 4C4\nPhone(604) 263-3261", "protocol": "Community Engagement engage@musqueam.bc.ca ", "about": "We are traditional hən̓q̓əmin̓əm̓ speaking people. The name Musqueam relates back to the flowering plant, məθkʷəy̓, which grows in the Fraser River estuary.  There is a sχʷəy̓em̓ that has been passed on from generation to generation that explains how we became known as the xʷməθkʷəy̓əm – People of the məθkʷəy̓ plant. The old people spoke of a small lake called xʷməm̓qʷe:m (Camosun Bog) where the sʔi:ɬqəy̓ (double-headed serpent) originated. They were warned as youth to be cautious and not go near or they would surely die. This sʔi:ɬqəy̓ was so massive its winding path from the lake to the stal̕əw̓ (river) became the creek flowing through Musqueam to this day. Everything the serpent passed over died and from its droppings bloomed a new plant, the məθkʷəy̓. For this reason, the people of long ago named that place xʷməθkʷəy̓əm (Musqueam – place of the məθkʷəy̓). Musqueam’s ancestors have lived in the Fraser River estuary for thousands of years. Today, portions of Musqueam’s traditional territory are called Vancouver, North Vancouver, South Vancouver, Burrard Inlet, New Westminster, Burnaby, and Richmond.", "spread": "Lower Mainland - Spread 7", "web": "https://www.musqueam.bc.ca/", "map": "Musqueam Indian Band", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-musqueamTTM.jpg\n", "pronounce": "MUSS-quee-um", "dId": ""}]}, "Neskonlith Indian Band": {"loc": [51.21274, -118.846623], "info": [{"community": "Neskonlith Indian Band", "leadership": "Chief Judy Wilson (Next election January 23, 2023)", "contactPerson": "Andrea Blackwater - Referrals Coordinator referrals@neskonlith.net", "contactInfo": "PO BOX 318, CHASE, BC\nPostal code V0E 1M0\nPhone(250) 679-3295", "protocol": "Andrea Blackwater - Referrals Coordinator referrals@neskonlith.net", "about": "The Neskonlith Secwepemc community is one of five Lakes Division Communities of the Secwepemc Nation.  The Lakes Secwepemc inhabits the eastern most part the Secwepemc Territory in and around the South Thompson River and the large Shuswap, Adams and Mara Lakes.  Traditionally this complex of waterways played a large role in the Lakes Secwepemc travel patterns.\n\nLake Division Secwepemc Winter villages were almost exclusively on the River Terraces on dry, well-drained sites near major streams and along lakes within the Lakes Division territories with good south exposure and shelter from the valley winds. Villages were often near an important fishery, so there were many small villages of a few families scattered up and down the main rivers and along major lakes.  Pit houses were the preferred c7’Istkten (winter homes), but there were other styles of insulated houses as well.\n\nThe Lakes Secwepemc delayed their move into the village as long as good weather held, but usually they were settled in by November. Early in winter, the villages were used as a basecamp for hunting and fishing expeditions while the houses were readied for the swucwt (snow) season.  Ts’i7 (deer), Ten’Iye (moose) and SweIaps (sheep) moved down from the mountains in their autumn prime and closer to the villages. These important food animals were in their rut in November, and easy to bait and call. The rivers were the source of sqlelten (salmon), a staple in Secwepemc diet, economy and culture. Whenever salmon were in our rivers, our people harvested sqlelten using various methods. Even in early spring and early winter a few people would be camped near the salmon rivers, eating fresh sqlelten.  By mid-summer, the main sqlelten runs were underway and most people were camped at the riverside fishing stations.  A frenzied month of fishing, processing, camp maintenance, and transportation to the winter village gradually ended as the fishery tapered off. The fishing basecamps were the centre of feasting, marriage, ceremony, and dancing. Important fishing camps were also the point of trade between neighboring villages and nations. Major bartering ceremonies in the region attracted over 1,000 participants.\n\nLate in the sqlelten season, men made snowshoes, nets, rope and other winter gear or searched for the fine-grained rock, especially black basalt to make adzes and other tools. Women completed processing and storing the catch.  The River Valley was hunted for Ts’i7 and other ungulates seeking winter protection in the riverside forests, but only on mild days because the animals were lean. In deep S7istk (winter) our people stayed in the village and lived on food stored during spring, summer and fall foraging trips.  On warmer days, a few individuals and small parties might try pixem (hunting) for Ts’i7 in nearby grasslands or ice fishing or hare and grouse snaring near a forest margin.\n\nThe Lakes Secwepemc left their c7’Istkten’s as soon as weather allowed, usually in February when melting snows and longer days made hunting easier, and even a few early plants were sprouting. The River Terraces near the villages were also habitat for many plants the Secwepemc used for food.  Spring was also the time to collect materials for making the basic tools of Secwepemc technology -bows, arrows, containers, tool handles, rope, and cordage, made from sap-filled willow, mock orange, juniper birch, maple, cottonwood, Saskatoon, and bitter cherry.", "spread": "Thompson Country Spread 4 (KP 610 to 764) ", "web": "https://neskonlith.net/", "map": "Neskonlith Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/neskonlith_ftoa_19dec12.pdf", "pronounce": "Nes-con-lith", "dId": ""}]}, "Nooaitch Indian Band": {"loc": [49.690318, -120.648292], "info": [{"community": "Nooaitch Indian Band", "leadership": "Chief Marcel Shackkelly", "contactPerson": "Larry Jordan, Band Administator (250) 378-6141", "contactInfo": "(250) 378-6141 reception@nooaitch.com   ljordan@nooaitch.com", "protocol": "David Lawrence Bosnich - Lands Manager david@nooaitchband.ca", "about": "The Nooaitch Indian Band is one of the member’s bands of the Nicola Valley Tribal Nation. Situated in the Nicola traditional territory, of what today to British Columbia is the Thompson-Nicola region of the southern interior, Nooaitch has two reserve bases totaling 1693.4 hectares, I.R. # 9 & I.R.10. The largest is I.R. #10 encompassing 903.1 hectares, is the main reserve where the community is based, and is situated 23 kilometers west of Merritt, B.C.", "spread": "Thompson Okanagan - Spread 4 (KP 710 to 764)", "web": "https://www.scwexmxtribal.com/member-bands/44-nooaitch-indian-band.html", "map": "Nooaitch Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/nooaitch_fro_mar08.pdf", "pronounce": "Noo-eye-ch", "dId": ""}]}, "Osoyoos": {"loc": [49.114526, -118.489264], "info": [{"community": "Osoyoos", "leadership": "Chief Clarence Louie (Next election February 21, 2023 -every 2 yrs)", "contactPerson": "Chief Clarence Louie      chief@oib.ca", "contactInfo": "1.888.498.3444   (250) 498-3444", "protocol": "", "about": "The Syilx of the Okanagan Nation, live in eight communities in the interior of British Columbia and Washington. Over 400 band members live and work on the Osoyoos Indian Reserve which stretches from Oliver to Osoyoos.  Okanagan First Nations once travelled widely to fishing, gathering and hunting areas. Each year, the first harvests of roots, berries, fish and game were celebrated by ceremonies honouring the food chiefs who provided for the people. During the winter, people returned to permanent winter villages. The names of many of the settlements in the Okanagan Valley–Osoyoos, Keremeos, Penticton and Kelowna–come from aboriginal words for these settled areas and attest to the long history of the Syilx people on this land.", "spread": "Thompson Okanagan - Spread 4 (KP 710 to 764)", "web": "http://oib.ca/", "map": "Osoyoos", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/osoyoos_signed_03may11.pdf", "pronounce": "O-soy-use", "dId": ""}]}, "Pacheedaht First Nation": {"loc": [48.572918, -124.39459], "info": [{"community": "Pacheedaht First Nation", "leadership": "Chief Jeff Jones (next election January 25, 2022)", "contactPerson": "April Roper - Band Manager bandmanager@pacheedaht.ca", "contactInfo": "350 Kalaid Street, Box 170, PORT RENFREW, BC\nPostal code  V0S 1K0\nPhone(250) 647-5521", "protocol": "April Roper - Band Manager bandmanager@pacheedaht.ca", "about": "The name \"Pacheedaht\" translates to English as \"Children of the Sea Foam\". Pacheedaht people are related by kinship, language and culture to several other First Nations on Vancouver Island and to the Makah. According to traditional history, long ago Pacheedaht and Ditidaht ancestors lived together as one tribe at an origin village located on the river whose native name is Diitiida. If you look for the name Diitiida on a map today, you won't find it, since most of the Pacheedaht names for places have been replaced by English place names. The river the Pacheedaht call Diitiida is marked as \"Jordan River\" on modern maps.\n\n The Ditidaht First Nation get their name from the village shared at Jordan River. Ditidaht means \"People of Diitiida,\" or people of Jordan River. During the great flood, some of the people living at Diitiida managed to survive by fleeing in a canoe that they anchored to the top of a high mountain in order to escape the rising waters. Afterwards some of the survivors settled at Whyac village at the outlet of Nitinat Lake into the Pacific Ocean, and became the ancestors of the people who today form the Ditidaht First Nation.\n\nOthers amongst the flood survivors returned to the village at Diitiida (Jordan River) and settled once again in their home territory. Eventually this branch of the people from Diitiida became centred on a village at the head of Port San Juan at the mouth of the San Juan River, called p'a:chi:da. This is also the native name for the San Juan River. Before the diseases came to our territory, brought by white explorers, traders and settlers, some estimates say that the Pacheedaht numbered 1,500 people or more. Pacheedaht ancestors followed a seasonal round that included moving residence to several places throughout an average year in order to take advantage of seasonally abundant resources. Pacheedaht villages and camps were spread throughout the territory, especially along the coastline and on the banks and mouths of larger rivers. A typical Pacheedaht house would be occupied by four to six families with each having its own fireplace inside the house.", "spread": "Lower Mainland - Spread 7 ", "web": "http://pacheedahtfirstnation.com/", "map": "Pacheedaht First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/pacheedaht_signed_february_17_2021_1.pdf", "pronounce": "Pah-chee-da", "dId": "pacheedaht"}]}, "Pauquachin Nation": {"loc": [48.724102, -123.324246], "info": [{"community": "Pauquachin Nation", "leadership": "Chief Tom Allan (Next election October 23, 2022)", "contactPerson": "Bonnie Seward - Executive Assistant Bonnie@pauquachin.com", "contactInfo": "9010 WEST SAANICH ROAD, SIDNEY, BC\nPostal code  V8L 5W4\nPhone(250) 656-0191", "protocol": "Susan Miller - Administrator Administrator@pauquachin.com", "about": "The community of Pauquachin, a name generally meaning “the land of cliffs and bluffs”, is historically a First Nations community that is located on Southern Vancouver Island. Pauquachin was originally part of the WSANEC (Saanich) Nation, which also includes Tsawout, Tsartlip and Tseycum.  These bands share a common history and territory.  The Saanich Nation belongs to a broader cultural group known as Central Coast Salish.  Saanich First Nation settlements have been mostly concentrated on the western side of the Saanich Peninsula.  the population in Pauquachin began as a small group of 14 families and many of these families are still present today.\n\n Historically, Pauquachin’s economic life has been based on salt-water adaptation due to the community’s position on the Saanich Peninsula.  Saanich people developed a reef-netting technology to gather their food, which was unique to their cultural area.  Fishing and hunting sites were organized into areas that were “owned” by certain families and ares that were “open” to everyone.  historians found that the majority of sites were open resource areas. The material culture and residential pattern of the Saanich people were oriented around the seasonal availability of ocean foods within their traditional lands.  Some historians believe that Point Roberts was the summer fishery for the Saanich people while Goldstream was the winter fishery.\n\n According to historical records, traditional Saanich housing comprised of 100 foot long cedar longhouses and they would house multiple families.  In 1932, artist Arthur Pitts created a painting of a 100 foot cedar longhouse on the Pauquachin reserve, which he referred to as “Llalam”.  “Llalam” may be a variation of the Hul’qumi’num word for home, “lelum”.  Cedar trees were an important resource for the Saanich people, as both their longhouses and dugout canoes were made from cedar.  Saanich warriors defended this resource, as they fought against early colonial settlers who were cutting down cedars for milling at the nearby sawmill.\n\nThe Pauquachin people continue to this day to be a resilient community who seek to build a healthy, self reliant and economically strong community.", "spread": "Island Community South", "web": "", "map": "Pauquachin Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-tsartlipTTM.jpg\n", "pronounce": "Pak-quw-chin", "dId": ""}, {"community": "Tsartlip First Nation", "leadership": "Chief Don Tom - election December 7, 2021", "contactPerson": "Victor Rumbolt - Administrator admin@tsartlip.com", "contactInfo": "PO BOX 70, #1 Boatramp Road, BRENTWOOD BAY, BC\nPostal codeV8M 1R3\nPhone(250) 652-3988", "protocol": "Victor Rumbolt - Administrator admin@tsartlip.com", "about": "A signatory to the Douglas Treaty of 1850, Tsartlip First Nation is one of four Saanich tribes situated on the Saanich Peninsula of British Columbia’s Vancouver Island. (Saanich Nations include Pauquachin, Tsawout and Tseycum). Meaning “land of maples” in the SENC'OTEN language, the Nation’s main community is South Saanich Indian Reserve 1, located near the town of Brentwood Bay. The membership total of Tsartlip is 982, with the majority of 684 citizens living on reserve.", "spread": "Island community ", "web": "http://tsartlip.com/", "map": "Pauquachin Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-tsartlipTTM.jpg\n", "pronounce": "Sart-lip", "dId": ""}, {"community": "Tsawout First Nation", "leadership": "Chief Harvey Underwood- next election July 6, 2023", "contactPerson": "Cathy Webster - Governance/Support Manager cwebster@tsawout.ca", "contactInfo": "7728 TETAYUT ROAD, SAANICHTON, BC\nPostal codeV8M 2E4\nPhone(250) 652-9101", "protocol": "Cathy Webster - Governance/Support Manager cwebster@tsawout.ca", "about": "The Tsawout First Nation is one of five bands that constitute the Saanich Nation. The other bands of the Saanich Nation are Tsartlip, Tseycum, Malahat and Pauquachin. Saanichton Bay has historically been, and continues to be significant to the Saanich peoples of Tsawout.  The bay provided shelter from the prevailing southeast gales of winter, a year-round source of food, as well as playing an integral role in the Tsawout economic, societal, social, and spiritual life.  Because of these reasons Saanichton Bay was one of the main winter village sites of the Saanich peoples, and that is why Tsawout “Indian Reserve” is located there today.\n\nIt is important to mention that the people of Tsawout were not stationary at Saanichton Bay year-round, though this was our “headquarters”.  The Saanich peoples territory includes the Saanich Peninsula, south to Mount Douglas, across to Mount Finlayson and Goldstream.  In addition, the Southern Gulf Islands, reaching to Point Roberts, and San Juan Islands constituted what is the Saanich Peoples traditional territory.  The Tsawout and Saanich people’s traditional territory is the lands and seas that we traditionally used throughout every season.  Names were given to all places we knew, every bay, every stream, every village, every mountain, every lake, every inlet, and island has a name in our language, the SENĆOŦEN language.  Our Language, place names, stories, history is what defines our territory and speaks to our long standing relationship to the land and waters. In the 1850s, Tsawout became a signatory to the Douglas Treaties, a series of treaties signed by some First Nations on Vancouver Island and the Colony of Vancouver Island.", "spread": "Island Community ", "web": "https://tsawout.ca/", "map": "Pauquachin Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-tsartlipTTM.jpg\n", "pronounce": "Tsa-woot", "dId": ""}, {"community": "Tseycum First Nation", "leadership": "Chief Tanya Jimmy - next election July 24, 2023", "contactPerson": "Chief Tanya Jimmy chief@tseycum.ca", "contactInfo": "1210 Totem Ln, North Saanich, BC V8L 5S4       Office: 250-656-0858", "protocol": "Kristen Bill - Band Administrator kristen@tseycum.ca", "about": "The Tseycum First Nation is a First Nations government located on southern Vancouver Island near Victoria. Tseycum (Union Bay Indian Reserve No.4) is one of the four Saanich villages of Southern Vancouver Island, located at the centre of Patricia Bay on the Saanich Peninsula. In the Sencoten langauge Tseycum is spelled Wsikem and means Land of Clay.", "spread": "Island Community ", "web": "http://www.tseycum.ca/", "map": "Pauquachin Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-tsartlipTTM.jpg\n", "pronounce": "Tsay-kum", "dId": ""}]}, "Penticton Indian Band": {"loc": [49.732366, -119.25376], "info": [{"community": "Penticton Indian Band", "leadership": "Chief Greg Cabriel (October 20, 2024)   Councillors; December 11, 2020 - Clint George, Suzzane Johnson, Elliot Tonasket, Carlene George, Fred Kruger, Vivian Lezard, Inez Pierre, Charlene Roberds", "contactPerson": "Chief Greg Gabriel chief.greg.gabriel@pib.ca", "contactInfo": "RR 2 SITE 80 COMP 19, PENTICTON, BC\nPostal code  V2A 6J7\nPhone(250) 493-0048", "protocol": "Chief Greg Gabriel chief.greg.gabriel@pib.ca", "about": "SnPink’tn (The Penticton Indian Band) represents one of the seven communities of the Okanagan Nation. The other six communities being Upper Similkameen, Lower Similkameen, Osoyoos Indian Band, Westbank Indian Band, Okanagan Indian Band, and Upper Nicola Indian Band.\n\nThe Penticton Indian Band community members have declared that the nation is the proper title and rights holders of the whole of the Okanagan territory. As Okanagan people, we have a collective right and responsibility to protect and manage our land, our people, our culture (which includes language) and our spirituality. The Okanagan people have been around since time immemorial, long before the arrival of the Europeans.\n\nThe original people of the Okanagan are known as the Syilx speaking people – the “Okanagans” and according to their history they have been here since the beginning of people on this land.\n\nTheir history was passed on from one person to another and from generation to generation. It is a history of the meaning of being Syilx, rather than a history of dates.\n\nThe Okanagans (Syilx) people occupied an area which extended over approximately 69,000 square kilometres. The northern area of this territory stretched from the area of Mica Creek, just north of modern day Revelstoke, BC and east to Kootenay Lake. The southern boundary extended to the vicinity of Wilbur, Washington and the western border extended into the Nicola Valley.\n\nThe Penticton Indian Band (PIB) comprises 3 reserves with a 19,436 hectare land base and is located four kilometres from the Penticton City limits. Geographically PIB has the  largest land base and is bordered to the north by the city of Summerland, to the west by the City of Penticton and to the South and West by Highway 97.", "spread": "Thompson Okanagan - Spread 4 (KP 710 to 764)", "web": "http://pib.ca/?page_id=5", "map": "Penticton Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/pentictor_fcrsa_-_2014.pdf", "pronounce": "", "dId": ""}]}, "Peters Band": {"loc": [49.505163, -121.482617], "info": [{"community": "Peters Band (Peters First Nation)", "leadership": "Chief Norma Jean Webb (next election December 22, 2021)", "contactPerson": "Victoria Peters - Councilor/Manager vpeters.petersband@gmail.com ", "contactInfo": "16870 PETERS ROAD, HOPE, BC\nPostal code  V0X 1L2\nPhone(604) 794-7059", "protocol": "Victoria Peters - Councilor/Manager vpeters.petersband@gmail.com ", "about": "Historically the land that we reside on was owned by “Joseph Peters”. Overtime the Canadian government came in and appropriated his land making it into what is now known today as Peters IR1, IR1a and IR2 under the Indian Act. Through the early days, the habitants of our land were all related until the agents started coming in and writing down the names of people who were visiting the reserve, a common practice throughout Canada and many times names would appear on several band lists. Today we continue to use our land as we have since time immemorial.", "spread": "Spread 5 (KP 806 to 1075)", "web": "http://petersfn.ca/", "map": "Peters Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/peters_band_fcrsa_executed_sept9_2016public.pdf", "pronounce": "", "dId": ""}]}, "Penelakut Tribe": {"loc": [48.892388, -123.675652], "info": [{"community": "Penelakut Tribe", "leadership": "Chief Joan Brown (Next election February 19, 2024)", "contactPerson": "Sharon Cross - Councilor/Economic Development Portfolio sharon@penelakut.ca (250-246-2321)", "contactInfo": "PO BOX 360, CHEMAINUS, BC\nPostal codeV0R 1K0\nPhone(250) 246-2321", "protocol": "Sharon Cross - Councilor/Economic Development Portfolio sharon@penelakut.ca (250-246-2321)", "about": "The Penelakut are a large (about 1000 individuals) Hul'qumi'num-speaking First Nation. They live primarily on Penelakut Island (formerly Kuper Island) near the south end of Vancouver Island and Galiano Island. The name Penelakut comes from penálaxeth', the village on the northeast end of Penelakut Island, once the largest Hul'qumi'num-speaking village in the Gulf Islands. Penálaxeth' means \"log buried on the beach\", which may refer to the many longhouses that were once on the beach near there. Historically, there were three permanent winter villages on Penelakut Island: at Penelakut Spit, Telegraph Harbour, and Lamalchi Bay. There were also villages at Chemainus Harbour and on Galiano Island. The term ‘Penelakut’ is used to refer to all the Hul’qumi’num people who, at one time or another, have lived among these islands.", "spread": "Island community ", "web": "https://penelakut.ca/", "map": "Penelakut Tribe", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/penelakut_tribe_fcrsa.pdf", "pronounce": "Pen-EL-ah-kut", "dId": ""}]}, "Popkum First Nation": {"loc": [49.57071, -121.506875], "info": [{"community": "Popkum First Nation", "leadership": "Chief James Murphy- (appointed 01/01/84), Councillor; Cynthia Murphy", "contactPerson": "Chief James Murphy popkum@live.ca (Cell: 604 378-1027)", "contactInfo": "54951 JULSETH ROAD, POPKUM, BC\nPostal code  V0X 1X1\nPhone(604) 846-1988", "protocol": "Chief James Murphy popkum@live.ca (Cell: 604 378-1027)", "about": "The Popkum First Nation or Popkum Band is a band government of the Sto:lo people located in the Upper Fraser Valley region, at Popkum, northeast of Chilliwack, British Columbia, Canada.", "spread": "Spread 5 (KP 806 to 1075)", "web": "", "map": "Popkum First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/popkum_fcrsa_renewal2020_executed_2020-03-27.pdf", "pronounce": "", "dId": ""}]}, "Qayqayt_First_Nation": {"loc": [49.205717, -122.910944], "info": [{"community": "Qayqayt First Nation (New Westminister) ", "leadership": "Chief Rhonda Larrabee (1994), Councillors; Rodney Bandura (1994), Ronald Lee (1994), Roberta Bandura (1995)", "contactPerson": "Chief Rhonda Marietta Larrabee qayqayt@shaw.ca", "contactInfo": "105 - 3680 RAE AVENUE, VANCOUVER, BC\nPostal codeV5R 2P5\nPhone(604) 451-0531", "protocol": "Chief Rhonda Marietta Larrabee qayqayt@shaw.ca", "about": "The people who were permanent residents of what is now considered New Westminster were Musqueam and Kwantlen. Throughout the 1800s Musqueam and Kwantlen are continually documented as being in at qiqéyt and t̕sic̓əl̕əs. A reserve for the “Langley Indians” (Kwantlen First Nation) nd Musqueam (Musqueam I.R. #1) was established directly on top of the fishing village of qiqéyt. In 1879, the federal government allocated three reserves as general reserves for “All Coastal Indians.” These reserves were established inclusive of 104 acres (0.42 km2) of the South Westminster Reserve, 22 acres (89,000 m2) on the North Arm of the Fraser River and 27 acres (110,000 m2) on Poplar Island.[2] These carry the Musqueam names of yeləɬkʷə, skʷtexʷqən, and wə́q̓ʷaχən sχʷayəməɬ.\n\nOn September 4, 1913 George Roberts “of the New Westminster Band of Indians” met with commissioners of the British Columbia, Royal Commission on Indian Affairs. In his interview Roberts acknowledged Musqueam as chief of the “New Westminster” Indians and many Musqueam continued to use the site seasonally through the 1930s and 40s for fishing.[3] Musqueam continued to live at qiqéyt into the 1930s. In 1959 this reserve was sold to pay for a water systems on Musqueam's I.R. #2. qiqéyt continues to be important to Musqueam and they continue to fish in the waters around this important village site.  In Musqueam issued their Declaration which states Musqueam’s rights and title to their unceded traditional territory and countersigned by the community at the time. qiqéyt is site #32.\n\nKwantlen First Nation recognizes qiqeyt as a very significant part of their unceded traditional territory. Many Kwantlen families trace their direct lineage from qiqeyt Village in South Westminster (now Lehigh Hanson Concrete Batch Plant).\n\nThe Aboriginal Gathering Place at the New Westminster campus of Douglas College was built in partnership with the Qayqayt First Nation. This Gathering Place contains a large mural depicting and celebrating the Band and its people.  Wikipedia        In the 19th century, a village alongside of what is now Front Street in New Westminster was called Qayqayt (pronounced Ka-kite). In 1859, New Westminster City Council sought to remove the First Peoples from the city core, creating three reserves in the surrounding area, including 27 acres of Poplar Island and 105 acres across the Fraser River at Bridgeview.   A smallpox epidemic killed many First Peoples in 1904; in 1916, the McKenna McBride Commission closed the New Westminster Indian Reserve and told the residents to move. Many reserves in British Columbia were being closed at this time, most without compensation or alternative lands to help them move. Qayqayt from New Westminster were married into or adopted into other Nations, relocating to Musqueam, Squamish, and Washington State. The story of the Qayqayt was almost forgotten.  Chief Larrabee’s mother, aunt and uncle were the last few living members of the Qayqayt First Nation, which once numbered 400 people before their lands were sold and their remaining reserve was deemed inactive in 1951. Chief Larrabee’s journey of self-discovery led her to apply for Indian Status in 1994, resurrect the Qayqayt Band, become chief, and work to keep the legacy of her ancestors alive through education. Her story is captured in the award winning National Film Board of Canada documentary “A Tribe of One.” \n", "spread": "Lower Mainland Spread 7", "web": "", "map": "Qayqayt_First_Nation", "srcTxt": "", "srcLnk": "", "pronounce": "Kee-kite", "dId": "qayqayt"}]}, "Sc'ia'new First Nation": {"loc": [48.440888, -123.676887], "info": [{"community": "Scia'new First Nation (Beecher Bay First Nation)", "leadership": "Chief Russ Chipps (next election: October 8, 2023)", "contactPerson": "Chief Russ Chipps (250) 478-3535 bb.fn@telus.net", "contactInfo": "4901B EAST SOOKE ROAD, SOOKE, BC\nPostal codeV9Z 1B6\nPhone(250) 478-3535", "protocol": "Ruth Sauder - Band Manager ruths.fn640@yahoo.com", "about": "The word \"Sc'ianew\" (pronounced CHEA-nuh) translates from the Klallam language as \"the place of the big fish\", indicating the richness of the sea life in the region that sustains the Sc'ianew and neighboring First Nation communities with food, shelter, medicine, and clothing. Part of Sc'ianew traces their ancestry to people who spoke four different languages. The community recognizes all four languages although they are not all currently spoken. As with other First Nation names in the region, the place name \"Sc'ianew\" identifies what the inhabitants needed to know about the locale.", "spread": "Lower Mainland Spread 7", "web": "http://beecherbay.ca/", "map": "Sc'ia'new First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/scianew_fn_fcrsa_signed.pdf", "pronounce": "", "dId": ""}]}, "Sq'ewlets (Scowlitz) First Nation": {"loc": [49.25517, -121.964821], "info": [{"community": "Sq'ewlets (Scowlitz) First Nation", "leadership": "Chief Johnny Edward Williams (next election: June 9, 2023 every 2 yrs)", "contactPerson": "reception@sqewlets.ca  (604) 826-5813", "contactInfo": "P.O. Box 76\nLake Errock\nV0M 1N0", "protocol": "Katina Pennier - Land and Governance Officer katinapennier@gmail.com", "about": "For countless generations, the Sq’éwlets people have lived in this territory that is referred to as S’ólh Téméxw in our language -- Halq̓eméylem. Our people spoke one of the dialects of Halq̓eméylem. We have a special relationship to the land and the resources based on our history. We were, in the past, and continue today to be the caretakers of the land and resources for our future generations. When the world was not right, during the times of our origins, the people could transform back and forth into sturgeon. We consider ourselves Sqwōwich, People of the Sturgeon. Our special relationship with the land and resources comes from the time of the transformers, the Xexá:ls who taught us how to live right and relate to the living world in a good way.   In the old times, there were three main extended family groups in our Sq’éwlets community. As in other Coast Salish tribes, the leaders of these families carried prestigious names. These names were passed down through the generations, and still are today. Often, one family had a respected leader who was called the “Yewal Siyá:m” or “first going chief.” Our families owned and managed many types of resources--such as salmon fishing sites, fish traps and weirs, upland berry patches, wetlands growing basketry plants, islands where female dogs were kept while in heat, and hunting territories. High status Sq’éwlets people arranged for their sons and daughters to marry into other communities. This meant that Scowlitz people had strong ties to people from other Stó:lō villages. These marriages brought access to many types of food resources and created peace with our relations. High status men often had several wives from different communities.  In European society of the same time, most people were peasants or working class. Many of our people, however, were high status smelá:lh, or “worthy people”. A smaller number of people were like commoners. Beneath the commoners were two other groups. The first were known as s’téxem, or “worthless people” who had “lost or forgotten” their history. The lowest status people were skw’iyeth, slaves who were either captured in raids as children, bought, or the children of slaves.  This is how our society was before the Xwelítem (“Hungry People”; European settlers; newcomers without land or resource rights) came in the late 18th and early 19th centuries. ", "spread": "Spread 5 (KP 806 to 1075)", "web": "https://sqewlets.ca/", "map": "Sq'ewlets (Scowlitz) First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/sqwlets_fcrsa_2021_renewal_executed_2021-03-25_1.pdf", "pronounce": "Scow-litz", "dId": ""}]}, "Seabird Island Band": {"loc": [49.262475, -121.724003], "info": [{"community": "Seabird Island Band", "leadership": "Chief James (Jim) Harris  (next election April 22, 2023)", "contactPerson": "Fern Angus - Executive Assistant referrals@seabirdisland.ca", "contactInfo": "Office: (604) 796-2177  comm@seabirdisland.ca", "protocol": "Fern Angus - Executive Assistant referrals@seabirdisland.ca", "about": "The story of the Seabird Indian Band began over 130 years ago in June 1879 with Gilbert Malcolm Sproat (19 April 1834 – 4 June 1913), a representative of the Indian Reserve Commission, would consult with First Nations people and later allocate the island known then as Skow-a-kull (correct spelling Sq'éwqel) as a reserve to be held in-common by the people from Popkum, Skw'átits, Ohamil, Ska-wah-look, Hope, Union Bar and Yale because the land they currently resided on could not sustain crops, and the land on Seabird Island would provide rich soil and provide a place for First Nations families to live their lives on.\n\nSeabird Island speaks a mix of Halq'eméylem and Thompson language. The Halq'eméylem name for the Seabird Island Band, Sq'éwqel, is translated to \"Turn in the River\", the English name Seabird Island would be taken from the June 1858 groundings of a transport paddle-wheeler, the SS Sea Bird, on an island bar in the Fraser River across from Seabird Island.", "spread": "Spread 5 (KP 806 to 1075)", "web": "", "map": "Seabird Island Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/seabird_island_band_-_fcrsa.pdf", "pronounce": "", "dId": ""}]}, "Semiahmoo First Nation": {"loc": [49.012447, -122.767315], "info": [{"community": "Semiahmoo First Nation", "leadership": "Chief Harley Chappell (next election December 28, 2022)", "contactPerson": "Chief Harley Chappell hchappell@semiahmoofirstnation.org", "contactInfo": "16049 BEACH ROAD, SURREY, BC\nPostal codeV3S 9R6\nPhone(604) 536-3101", "protocol": "Chief Harley Chappell hchappell@semiahmoofirstnation.org", "about": "In 1790, Europeans estimated the Semiahmoo population at 300. By 1854, the band's numbers were reduced to 250 due to smallpox and warfare. In 1909 there were 38 band members in British Columbia. In 1963, the number had reached 28 and then just 25 by 1971. Between 1996 and 2001, the reserve population dropped 34.5 per cent, from 200 people to 131, and currently they have 98 registered members and 53 members who live on site\nThe Semiahmoo remain one of the smallest First Nations in the region with about 74 band members, of whom 40 live on Reserve. In fact, Semiahmoo has more non-Aboriginals living on its reserve than band members. As of 2003, the median age of the Semiahmoo population was 42.5 years: higher than the average for all people living on Indian Reserves in Greater Vancouver (which was 39.2 years).  Semiahmoo is the band government of the Semiahmoo people, a Coast Salish subgroup. The band's main community and offices are located on the 312 acres (1.3 km2) Semiahmoo Indian Reserve which is sandwiched between the boundary of White Rock, British Columbia and the Canada–United States boundary and Peace Arch Provincial Park.", "spread": "Spread 6 (KP 100)", "web": "", "map": "Semiahmoo First Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-semiahmooTTM.gif\n", "pronounce": "", "dId": "semiahmoo"}]}, "Shxw'owhamel First Nation": {"loc": [49.339668, -121.60638], "info": [{"community": "Shxw'owhamel First Nation", "leadership": "June 18, 2010      Si:yam  Melody Andrews, Lucille Casimir, Lenora Fraser, Alfred James, Dean Jones, Lenona Kelly, Sonny Mchalsie, , Louise Mussell, Brenda Peters, Shawna Peters, Irene Smith", "contactPerson": "Mr. Shane James - Chief Administrative Officer shane.james@shxwowhamel.ca", "contactInfo": "58700A ST. ELMO ROAD, HOPE, BC\nPostal codeV0X 1L2\nPhone(604) 869-2627\nFax(604) 869-9903", "protocol": "Sally Hope - Lands and Resources Manager sally.hope@shxwowhamel.ca", "about": "Shxw’ōwhámél people are the Stólō and Coast Salish people of the Tiyt [teet] Tribe. The area around Shxw’ōwhámél has many points of importance, generally in the watersheds of Jones, Lorenzetti, and Hunter Creeks. Just as Hope is of the Fraser Valley of British Columbia; Shxw’ōwhámél is part of the Tiyt Tribe of the Stólō  Nation . Shxw’ōwhámél (Ohamil) I.R #1, is geographically located 13 kilometers west of Hope BC along the Trans Canada Highway. Shxw’ōwhámél also has 2 other reserves: Wahleach IR #2 located along the Lougheed Highway, and Xelhálh (kuth-lath) IR#3 located north of Yale BC along Highway #1.    Xelhálh holds special significance for us. Xelhálh was strategically placed overlooking the Fraser River, and was protected by a fortress and the river itself. The river in this area has several whirlpools and rapids which, back then, made it challenging to navigate to shore for any people unfamiliar with the area. In addition to the remnants of the fortress, Xelhálh was the home for a large number of people up until the 1850s. When the population was decimated by the smallpox epidemic our remaining ancestors were moved by the colonial government. The federal government moved our ancenstor to Shxw’ōwhámél trying to encourage them to pursue agricultural as way of building a substancial economy. This idea shifted our people away from relying on fishing, hunting, and gathering and trading between the communities.  Stólō means 'People of the River' in our Traditional Halq'eméylem language. The Fraser River was central to the lives of our ancestors and was formerly used as a major transportation conduit for facilitating trade with other villages. The Fraser River was and still remains a critical resource to our peoples' way of life as a food source . The lands and waters of our territory have provided many traditional resources of great value to the people of Shxw’ōwhámél. Aside from the salmon and sturgeon from the river, our people strategically walked the lands to hunt for deer, to harvest traditional plants and berries for food and medicines. ", "spread": "Spread 5 (KP 806 to 1075)", "web": "https://www.shxwowhamel.ca/", "map": "Shxw'owhamel First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/shxwwhmel_fcrsa_-_signed_may_1_2020.pdf", "pronounce": "Sh-wow-HA-mel", "dId": ""}]}, "Simpcw First Nation": {"loc": [52.634393, -119.699777], "info": [{"community": "Simpcw First Nation \"People of the Rivers\"", "leadership": "Chief Shelly Ann Loring  (next election May 31, 2021)    Councillors; Edward (Eddie) Celesta, Christine (Tina) Donald, Lori Eustache, Alison Eustache (Green), George Lampreau, Ronald (Ron Jr.)  Lampreau, ", "contactPerson": "Kerri Jo Fortier - Manager of Natural Resources Kfortier@simpcw.com", "contactInfo": "PO BOX 220, BARRIERE, BC\nPostal codeV0E 1E0\nPhone(250) 672-9995\nFax(250) 672-5858", "protocol": "Kerri Jo Fortier - Manager of Natural Resources Kfortier@simpcw.com", "about": "The Simpcw are part of the Secwepemc, or Shuswap, Nation - one of 17 Bands who historically (and currently) lived in the Thompson River Valley. Simpcw’s lands covered an area of roughly 5,000,000 Ha: from North of McLure to the head waters of the Fraser River at McBride; to Jasper in the East and South to the head waters of the Athabasca River. Archaeological surveys have found winter sites and food cache pits throughout the region, including finds in Finn Creek, Vavenby, Birch Island, Clearwater, Little Fort, Chu Chua, Barriere, Louis Creek, Tête Jeune, and Jasper.  Traditionally, the Simpcw people were known for their hunting abilities; much of the Simpcw culture centres on the gathering of local plants and animals for survival. In the summer months, hunting camps were established above the North Thompson and upper Fraser Rivers, where Simpcw people caught fish, primarily salmon, with nets, spears and weirs. They also hunted wildlife that lived in the forests and fields, and smoked or dried the meat for storage, so they would have food for the winter months. Plant collection was common; food, medicines and technology were common uses for the vegetation they collected.   Simpcw people often interacted with other First Nations bands that lived nearby, as well. They actively traded with other Secwepemc bands, as well as other Nations throughout the area. Sometimes, they fought with other Nations from BC and Alberta, usually over natural resources and land.   Currently, Simpcw First Nation has nearly 700 members, many of whom live in Chu Chua, the location of the main village of Simpcw First Nation. Many Simpcw members still practice and maintain traditional knowledge and customs, which are taught at Neqweyqwelsten School, along with the regular BC elementary school curriculum. However, Simpcw is also an active part of the modern workforce, with many business owners and professionals in the membership. The community remains close-knit, with community gatherings and other events happening often. This is all part of living up to Simpcw’s mission statement, which states: \"The Simpcw are a culturally proud community, valuing healthy, holistic lifestyles based upon respect, responsibility and continuous participation in growth and education.\"", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://www.simpcw.com/", "map": "Simpcw First Nation", "srcTxt": "Community website", "srcLnk": "https://www.simpcw.com/our-land.htm", "pronounce": "Simp-qwuh", "dId": ""}]}, "Siska Indian Band": {"loc": [50.117565, -120.838519], "info": [{"community": "Siska Indian Band", "leadership": "Chief Fred Sampson (next election January 23, 2023)", "contactPerson": "Chief Sampson siskaib@lytton.bc;  Loretta Edzerza - Band manager/Referrals administrator@siskaband.ca", "contactInfo": "PO BOX 519, LYTTON, BC\nPostal codeV0K 1Z0\nPhone(250) 455-2219\nFax(250) 455-2539", "protocol": "Terry Raymond - Lands Manager tray69770@msn.com", "about": "The location of Siska is most notable for the dual railbridge crossing of the two Canadian transcontinental railways, the CPR and CNR, just above the reserve. Siska is often spelled in historical documents and publications as \"Cisco\", a spelling which remains on the map for the railway points at this location and also for Cisco Bluff, which the CPR line pierces opposite Siska Flat, which is the location of the main rancherie of the First Nation.", "spread": "Spread 5 (KP 806 to 1075)", "web": "", "map": "Siska Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/siska_fcrsa_fn_executed_april_16_2018.pdf", "pronounce": "Sis-kah", "dId": ""}]}, "Shuswap Indian Band": {"loc": [50.367907, -116.89554], "info": [{"community": "Shuswap Indian Band ", "leadership": "Chief Barbara Cote (next election: November 1, 2022)", "contactPerson": "Stewardship Office - Clarine Capilo, Office Administration clarine@shuswapband.ca  250-341-3678 ext 200", "contactInfo": "RR#2, 3A - 492 Arrow Road, INVERMERE, BC\nPostal codeV0A 1K2\nPhone(250) 341-3678\nFax(250) 341-3683", "protocol": " Clarine Capilo - Office Administration clarine@shuswapband.ca", "about": "The First Nations people have always been keepers of the land, using its bounty to sustain their way of life. Native culture hinges on the belief that the land responds positively to care and respect. Those who nurture the land will receive back from it ten-fold. The vision of Eagle Ranch was born out of this intrinsic cultural belief. The Band was created when the government of the then-Colony of British Columbia established an Indian Reserve system in the 1860s. Though a member of the Ktunaxa Kinbasket Tribal Council and intermarried with the Ktunaxa bands in the same region, the members of the band are ethnically Secwepemc (Shuswap). Kinbasket Lake, now the name of the reservoir formed by Mica Dam, was named in 1866 by Walter Moberly, in honour of Kinbasket, a chief of the Columbia River Shuswap whom he had employed.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "http://www.shuswapband.net/", "map": "Shuswap Indian Band", "srcTxt": "", "srcLnk": "", "pronounce": "Shoe-swap", "dId": ""}]}, "Skawahlook First Nation": {"loc": [49.227586, -122.174045], "info": [{"community": "Skawahlook First Nation", "leadership": "Chief Maureen Chapman (Hereditary)     Governance consists of one Chief and one Councillor who are appointed using traditional matrilineal methods.", "contactPerson": "Chief Maureen Chapman  maureen@skawahlook.com", "contactInfo": "58611A Lougheed Hwy, Agassiz, BC V0M 1A2       604-796-9129  info@skawahlook.com", "protocol": "Chief Maureen Chapman  maureen@skawahlook.com", "about": "Skawahlook First Nation has 100 Band members. Currently, only eight members live on reserve.  There are 35 non-members living on reserve. Total reserve population is therefore 43.        The Skawahlook First Nation, formerly the Tait Indian Band is a band government of the Sto:lo people whose reserves and communities are located in the Upper Fraser Valley region of British Columbia, Canada, near the community of Ruby Creek, which is at the eastern end of the District of Kent. Wikipedia      Sited within the Fraser River valley and only partially within the 200 year floodplain, the land on which the reserve is situated is largely flat, undeveloped, and amenable to development. However, our reserves are bisected by multiple rights-of-way (highway, railroad, and two gas pipelines) which limit some development options. The location of our reserves on the highway is none-the-less a positive from a business development point of view.  The primary economic initiatives that have been undertaken within Skawahlook consist of retail, service and commercial initiatives housed in new building facilities clustered together at 58611A Lougheed Highway. The Ruby Creek Art Gallery offers passing motorists a selection of Native art. A large hall and banquet facilities are also in operation.  See community website for additional information. skawahlook.com/history/\n\nSkawahlook First Nation is part of the Stó:lō Service Agency as a number of our services are administered through the Tribal Council. Skawahlook First Nation is a member of the Stó:lō Xwexwilmexw Treaty Association.\n", "spread": "Spread 5 (KP 806 to 1075)", "web": "www.skawahlook.com", "map": "Skawahlook First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/sqewlxw_fcrsa_renewal2020_executed_sept18_2020.pdf", "pronounce": "Skwa-ha-look", "dId": ""}]}, "Skwah First Nation": {"loc": [49.175281, -121.977269], "info": [{"community": "Skwah First Nation", "leadership": "Chief Lara Mussell (Next election: November 25, 2023)", "contactPerson": "Chief Lara Mussell  lara.mussell@skwah.org", "contactInfo": "PO BOX 178, CHILLIWACK, BC\nPostal codeV2P 6H7\nPhone(604) 792-9204\nFax(604) 792-1093", "protocol": "Chief Lara Mussell  lara.mussell@skwah.org", "about": "SKWAH FIRST NATION IS ONE OF THE LARGEST FIRST NATION COMMUNITIES IN THE STO:LO TERRITORY. WHILE THE CURRENT VILLAGE OF SKWAH SITS JUST UP FROM HISTORIC CHILLIWACK LANDING, OUR ORIGINAL LANDS WERE WHERE FIVE CORNERS IN DOWNTOWN CHILLIWACK NOW EXISTS.  Skwah First Nation is a vibrant community, with 238 of the 505 members living within its borders. There are a variety of private and public enterprises such as the famous Greg Moore Raceway which holds Kart racing on weekends throughout the year weather permitting. We also feature a mix of agricultural and residential land and it is not uncommon to see someone riding horseback through the community .", "spread": "Spread 6 (KP 1075 to 1144)", "web": "skwah.ca    ", "map": "Skwah First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/skwah_fcrsa_2020_renewal_executed_aug312020.pdf", "pronounce": "Squah", "dId": ""}]}, "Snuneymuxw First Nation": {"loc": [49.107871, -124.120584], "info": [{"community": "Snuneymuxw First Nation", "leadership": "Chief Wyse Mike (Feb 1, 2022), Councillors; Chris Good, Emmy (Emily) Manson, Erralyn Thomas, Joe Jr. White, Paul Wyse-Seward, Darren Good (Feb 2, 2024), Kate Good, Regan Seward, Isaac Matthew Thomas, William (Bill) Yoachim", "contactPerson": "Joan Brown - Chief Administrative Officer joanb@snuneymuxw.ca", "contactInfo": "668 Centre St, Nanaimo, BC V9R 4Z4           250-740-2300", "protocol": "Joan Brown - Chief Administrative Officer joanb@snuneymuxw.ca", "about": "The Snuneymuxw First Nation has a rich history and heritage. From the teachings and stories passed down through the generations to the sacred ceremonies, dances, and celebrations that honour our way of life and connection to this land, to the art, designs and symbols that reflect a higher meaning and purpose for our People, our history is a living story that continues to unfold. \n\nWhen Europeans first traveled to Snuneymuxw Territory Snuneymuxw villages dotted all of our Territory, including the mid-Island region of Vancouver Island, Gulf Islands, and the Fraser Valley. Snuneymuxw society, way of life, culture and economy extended throughout the Territory, which was governed by Snuneymuxw according to our Snawaylth. The Snuneymuxw population at the time was in the thousands.  The earliest documented contact with Europeans was the arrival of the Spanish in 1792. Prior to that however there was extensive commercial activity as part of the maritime fur industry. The Hudson’s Bay Company established a post in Nanaimo in 1852 as part of the colony of British Columbia. In order for the settlers to access the rich coal deposits in Snuneymuxw Territory, the Crown and Snuneymuxw entered into the Treaty of 1854.  The history of Snuneymuxw since the arrival of the settlers has been one of strength, perseverance, and endurance in the face of injustice, colonial oppression, disease, and prejudice. As a reflection of Crown laws, policies and actions, Treaty promises have been broken, Snuneymuxw villages unlawfully alienated, a foreign system of government imposed through the Indian Act, and family and kin systems interfered with.  Despite this, Snuneymuxw continues to thrive and has a growing and increasingly educated population, an ever-diversifying economy, society, and governance structure, rooted in Snuneymuxw values, culture and way of life.", "spread": "Vancouver Island - Southeastern ", "web": "https://www.snuneymuxw.ca/", "map": "Snuneymuxw First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/snuneymuxw_first_nation_framework_agreement.pdf", "pronounce": "Snoo-NAI-muk / Snuh-NAY-mow", "dId": ""}]}, "Squamish First Nation": {"loc": [49.807197, -123.200082], "info": [{"community": "Squamish First Nation (Squ-Ho-0-meesh)", "leadership": "Chief Councillor,  Ian Campbell (Next election: December 11, 2021), Councillors; ", "contactPerson": "Consultation_RightsandTitle@Squamish.net", "contactInfo": "Phone: 604-980-4553   1 877-628-2288", "protocol": "", "about": "The Skwxwú7mesh Úxwumixw (Squamish People, villages and community) have a complex and rich history. Ancient connections are traced within our language through terms for place names and shared ceremony among the Salmon Peoples of the cedar longhouse.   We are the descendants of the Coast Salish Aboriginal Peoples who lived in the present day Greater Vancouver area, Gibson’s landing and Squamish River watershed. The Squamish Nation has occupied and governed our territory since beyond recorded history.  Sixteen Síiyam (Chiefs) remain from a long line of leaders, and current Skwxwú7mesh generations can trace their connections to one or more of the strong leaders and speakers who signed the Almagamation on July 23, 1923.  The Amalgamation was established to guarantee equality to all Squamish people and to ensure good government.  ", "spread": "Lower Mainland Spread I (KP 1180.1)", "web": "https://www.squamish.net/", "map": "Squamish First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/squamish_fcrsa_renewal_2020_agreement_-_signed_july_23_2020.pdf", "pronounce": "SKWA-mish", "dId": ""}]}, "Stk'emlupsemc te Secwepemc": {"loc": [51.341443, -121.166411], "info": [{"community": "Stk'emlupsemc Te Secwepemc ", "leadership": "Chief Ronald Ignace", "contactPerson": "Debra Stokes - TMEP Coordinator/Community Liaison debra@stkemlupsemc.ca", "contactInfo": "334 Chief Alex Thomas Way, Kamloops, BC 1H1   (250) 373-0023", "protocol": "Travis Marr - Information and Referral Manager  Travis@stkemlupsemc.ca", "about": "The Stk’emlupsemc te Secwepemc Nation (SSN) consists of the Tk’emlúps te Secwépemc and Skeetchestn Indian Band. Originally, our work began in the 1800’s with the original eight tribes. Today only two (T’Kemlups and Skeetchestn) of the original eight remain and so it seemed wise to forge the two and create the Stk’emlupsemc to Secwepemc. Our fire is burning brightly working in collaboration as our leadership did in the day. Our collaborative organization is guided by our ancestors, always reminded of the importance of working together for our people. The Stk’emlúpsemc te Secwepemc Nation are responsible for Aboriginal Title and Rights on their Territory. In 2007 a Resource Sharing Protocol MOU was created to manage the conservation, negotiations and management of resources on Tk’emlúps te Secwepemc and Skeetchestn Indian Band’s shared territory forming SSN.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://stkemlups.ca/", "map": "Stk'emlupsemc te Secwepemc", "srcTxt": "", "srcLnk": "", "pronounce": "", "dId": ""}]}, "Sts'ailes Band": {"loc": [49.293578, -121.910722], "info": [{"community": "Sts'ailes Band (Chehalls Indian Band) ", "leadership": "Chief Ralph Jr. Leon (next election: March 20, 2022)", "contactPerson": "William Charlie - Chief Administrative Officer william.charlie@stsailes.com", "contactInfo": "4690 SALISH WAY, CHEHALIS ROAD, AGASSIZ, BC\nPostal codeV0M 1A1\nPhone(604) 796-2116", "protocol": "William Charlie - Chief Administrative Officer william.charlie@stsailes.com", "about": "The name ‘Sts’ailes’ is derived from the Halq’eméylem word ‘Sts’a’íles’, which means “the beating heart”. There are other interpretations, such as “heart on the chest” or “laying on the chest” (c.f. Galloway 1079), “running aground on a sand-bar with the chest of a canoe” (Duff, 1952:27). The Sts’a’íles name is also derived from a most important transformer legend about an Indian Doctor, Shay (aka: Cäi, Skoyá:m, etc.), who lived on the west side of Harrison Lake at Doctor’s Point, and did battle with Xá:ls (the great Transformer who walked this earth in the distant past to put things right). According to our legends, upon defeating Shay, the Doctor, Xá:ls ripped his heart from his chest and threw it downriver, where it landed at Sts’ailes near the confluence of the Chehalis and Harrison Rivers.\n\nAccording to Elders, there used to be a gravel-bar in the Harrison River fronting Sts’ailes IR 5 that used to pulsate like a beating heart during freshet. It disappeared in historic times. The Doctor himself was transformed into a rock at Doctor’s Point along the Harrison Lake. Today, as in the past, our culture and economy is centered on the land and its resources. Just as our ancestors knew the significance, use, and value of all resources and lands, we must also. This is essential not only to fully participate in the broader economy, but also to protect those resources and lands that are integral to Sts’ailes identity, success, and permanence.\n\n“Xa’xa Temexw”, literally translates to “sacred earth” and expresses the Sts’ailes’ spiritual, physical, and cultural connection to the land, its water, and its resources. Human beings (Xwelmexw) are only one small part of Xa’xa Temexw and have the responsibility to take care of it because all living things are interrelated and when one is affected, it affects the health and well-being of all.\n\nSts’ailes Xa’xa Temexw includes the entirety of Harrison Lake, Harrison River, Chehalis Lake, Chehalis River, the lower Lillooet River, the northeastern portion of Stave Lake, and the Fraser River between Hooknose and Queens Island. These major waterways are surrounded by ecologically diverse wetlands, estuaries, and floodplains, a multitude of valleys with small rivers and streams, mountain lakes, and glacial peaks. Situated throughout Sts’ailes Xa’xa Temexw were ancestral settlements, which were the nucleus of everyday commercial and domestic activities, and also semi permanent bases, which were used for hunting, fishing, plant gathering, and ceremonial trips.", "spread": "Spread 6 (KP 1075 to 1144)", "web": "http://www.stsailes.com/", "map": "Sts'ailes Band", "srcTxt": "", "srcLnk": "", "pronounce": "Che-HAY-lis / Sh-HAY-lis", "dId": ""}]}, "Sts'wecem'cXgat'tem (Canoe Creek)": {"loc": [51.586232, -122.204957], "info": [{"community": "Sts'wecem'cXgat'tem (Canoe Creek/Dog Creek)", "leadership": "Chief Hillary Adam (next election: June 7, 2024)", "contactPerson": "Clayton Harry - GM Economic Development clayton@sxdcltd.ca", "contactInfo": "GENERAL DELIVERY, DOG CREEK, BC\nPostal codeV0L 1J0\nPhone(250) 440-5645\nFax(250) 440-5679", "protocol": "Judah Melton - Referrals stewardshipTC@sxfn.ca", "about": "We were once two distinct bands: Canoe Creek and Dog Creek. The population of our two communities suffered a dramatic decline in the late 19th century, largely due to a smallpox epidemic in 1863-1864. The population of Dog Creek was reduced from more than two hundred members in the 1850s to a mere 20 members by the late 1860s.  Our two lower Fraser River bands joined together in the late nineteenth century and were then referred to as Canoe Creek Band by the Department of Indian Affairs.To this end, SXFN is one of four politically allied Secwepemc bands that form the North Shuswap Tribal Council, currently negotiating a modern treaty. There are 17 bands that form the greater Secwepemc nation.  The band office is located in Dog Creek.  Dog Creek also has a store/gas station/post office,  and a gymnasium/community centre. The Canoe Creek community has a band school and a gymnasium/community centre, beautiful log church, and a powwow arbour built by the community members.\n\nMembers of all ages are involved in various sporting events including ice and ball hockey, soccer, softball and rodeos. Also in their leisure time members carry out seasonal cultural activities, such as hunting for moose, deer, and big horn sheep; gathering roots and berries for food or medicine; trout and salmon fishing and the odd sturgeon is also caught.  In addition, Canoe Creek is also home to beautiful surroundings as it is enveloped by a large precipitous valley that has been the chosen landscape of many films, including the Hollywood film “The 13th Warrior” (1999) and “The Thaw” (2009).", "spread": "Spread 6 (KP 1075 to 1144)", "web": "https://sxfn.ca/", "map": "Sts'wecem'cXgat'tem (Canoe Creek)", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/sxfn_canoe_creek_indian_band_fcrsa_executed_february_3_2021.pdf", "pronounce": "St-wet-lem- hight-lem", "dId": ""}]}, "St'uxwtews (Bonaparte Indian Band)": {"loc": [50.839863, -121.372183], "info": [{"community": "St'uxwtews (Bonaparte Indian Band)", "leadership": "Chief Randy Porter (next election: March 5, 2021)", "contactPerson": "Chief Randy Porter 250-457-1025 kukpi7@bonaparteindianband.com", "contactInfo": "PO BOX 669, CACHE CREEK, BC\nPostal codeV0K 1H0\nPhone(250) 457-9624", "protocol": "", "about": "Kukpi7 is what Chiefs were called in Secwepemc. The Kukpi7s role is to work for the people and ensure that the lands and resources were protected for future generations. They did not stand above the people but walked beside them. Each community member was responsible for providing leadership to the Kukpi7 and voicing their concerns and interests. A Kukpi7s strength came from the community.  The Secwepemc people had family groupings and each family had people who displayed leadership in different areas that made them respected and trusted for their ability. These were the “Good People” who sat in on decisions and brought them back to their families. Today, they are referred to as Councillors. They represent their family and make decisions on behalf of the community. These individuals are selected in the same way as Kukpi7. They are personable, have recognized skills and knowledge and are advisors on all community matters. A Kukpi7 cannot works without ensuring that the interests of the people are considered and their success is linked to the Councillors.At a point of history, the Bonaparte Indian Band selected their leaders in a traditional manner until August 6, 1952, where under Order in Council PC 3692, stated that Chief and Council were to abide by elections under s.74 of the Indian Act. While this may prove to prevent Stuctwewsemc from continuing to practice their traditions, it is clear that the notion of family has continued and will continue to be integral for the future.  In Stuctwewsemc, the roles and responsibilities of the Chiefs and Councillors have seen much change in 74 years. It has not made the positions easier, in fact, if anything, the environment has added to the work. With the establishment of the Band Office in the 1970s, the Chief and Council, rather than the Indian Agent, preside over concerns within the community and also must deal with outside Government, Agencies, and Corporations. It is not just matters within the community. Leadership is evolving daily.\n\nThe Stuctwewsemc remain strong because the Bonaparte Community Members represent the people in other areas such as sports, education, rodeos, culture, traditions, and knowledge of history. The children, youth, adults and elders individual success reflects on the community both past and present. Let us continue to remember.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "http://www.bonaparteindianband.com/", "map": "St'uxwtews (Bonaparte Indian Band)", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/bonaparte_toa_08sept10.pdf", "pronounce": "Bone -eh-part", "dId": ""}]}, "Stz'uminus First Nation": {"loc": [48.846385, -123.630268], "info": [{"community": "Stz'uminus First Nation (ltst uw' hw-nuts'-ul-wun) Chemainus", "leadership": "Chief Roxanne Harris (Next election April 6, 2023)", "contactPerson": "Ronda Jordan - Director of Administration ronda.jordan@stzuminus.com", "contactInfo": "12611-A TRANS CANADA HIGHWAY, LADYSMITH, BC\nPostal codeV9G 1M5\nPhone(250) 245-7155", "protocol": "Ronda Jordan - Director of Administration ronda.jordan@stzuminus.com", "about": "We are a Coast Salish People who have lived around the Salish Sea for thousands of years. Our traditional territory on east Vancouver Island includes four reserves of more than 1,200 hectares, much of it bordering the Strait of Georgia and Ladysmith Harbour. Our Nation has 1,300 members with about half living on our reserves. ", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://www.stzuminus.com/", "map": "Stz'uminus First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/stzuminus_fcrsa_-_signed_mar_31_2020.pdf", "pronounce": "", "dId": ""}]}, "Sumas First Nation": {"loc": [49.052587, -122.193538], "info": [{"community": "Sumas First Nation", "leadership": "Chief Dalton Silver (April 30, 2022)", "contactPerson": "Chief Dalton Silver - dalton.silver@sumasfirstnation.com", "contactInfo": "2788 SUMAS MOUNTAIN ROAD, ABBOTSFORD, BC\nPostal codeV3G 2J2\nPhone(604) 852-4041", "protocol": "Chief Dalton Silver - dalton.silver@sumasfirstnation.com", "about": "The Sema:th people have been here since time immemorial, time out of mind, as the history of the Sema:th people goes beyond the flood story which had taken place well over 10,000 years ago.\n\nA very well respected man who comes from the mouth of the river, what we now call Musquem First Nation. This man could see into the future. He could see things coming before they happened. He seen the rising waters, the flood. When he seen the waters rising he travelled to all the communities up the river to tell the people that the waters were going to rise.\n\nThey were going to rise so high that they need to get their biggest canoes ready. He told them to make strong rope because the water is going to come up so high that they will need to tie their canoes to safety.\n\nHe told them they need to go to the top of Sumas Mountain as it is a place where they can tie their canoes, Sumas Mountain had fresh spring water and there was plenty of food up that they can use to survive while the waters were high. It’s been said that some of the people listened to his advice about the flood and some didn’t. The ones that didn’t tried to go to other mountains that they say were as high as Sumas Mountain but those people didn’t survive because those mountains didn’t have the food or water supply that Sumas Mountain once had.\n\nThere was a canoe on top of Sumas Mountain whose rope wasn’t strong enough to hold and the people in that canoe floated away. No one knows what happened to this canoe or the ancestors that were in it. There is some speculation that the canoe that broke away may have been ancestors of the Nuxalk People. As they are Coast Salish people who live in a place far from the Coast Salish Territory.\n\nIt’s been said that when the waters start coming down the people moved to the lower part of Sumas Mountain where they can be sheltered in the caves, these caves on Sumas Mountain are known to our people as the Thunderbird Caves. Later on when the waters receded more and more land started to appear on the horizon some of the people got in their canoes to settle in other areas. It’s been said that some canoes went North and some canoes went South.\n\nOur elders have said that’s why to the North of Sumas Mountain is Chehalis and there’s Scowlitz and to the South of Sumas Mountain what is now Washington State there is Chehalis and there’s Cowlitz. It’s been said that thousands of years ago these people were one in the same on top of Sumas Mountain during the great flood.\n\nSome have also said that the name for Chehalis the old pronunciation that is being revived now Stsalies, Stsalies is very close to a name that we all identify ourselves with which is Salish. This place we say we live in Sema:th is very sacred because of the histories that go back for our people.\n\nNot just for Sema:th but throughout the Salish Territory and we here at Sema:th are descendants of those who had their canoes tied to the top of this mountain thousands of years ago.", "spread": "Spread 6 (KP 1075 to 1144)", "web": "http://www.sumasfirstnation.com/", "map": "Sumas First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/sumas_fcrsa_-_signed_apr_22_2020.pdf", "pronounce": "", "dId": ""}]}, "Toosey Indian Band (Tl'esqox)": {"loc": [52.195501, -123.798415], "info": [{"community": "Toosey Indian Band (Tl'esqox)", "leadership": "Chief Francis Laceese - next election July 7, 2022", "contactPerson": "Greg Grayson - Band Manager  greg@tlesqox.com", "contactInfo": "PO BOX 80, RISKE CREEK, BC\nPostal codeV0L 1T0\nPhone(250) 659-5655", "protocol": "Greg Grayson - Band Manager  greg@tlesqox.com", "about": "Tl'esqox of the Tsilhqot’in is one of six communities in the Tsilhqot’in Nation. The Tsilhqot’in Nation is part of the Athabaskan linguistic and cultural group. The Tsilhqot’in language is the southernmost of the Athapaskan language family; one of eight language families in current BC. Tsilhqot’in Nation occupies the traditional territory from its current location south to the junction of the Chilcotin and Fraser Rivers. The Tsilhqot’in Nation is surrounded by the Carrier Nation to the north, the Nuxalk Nation to the west, the Shuswap Nation to the east and the St”at”imc Nation to the south.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "", "map": "Toosey Indian Band (Tl'esqox)", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-tlesqoxulkatchoTTM.jpg\n", "pronounce": "", "dId": ""}]}, "Tsawwassen First Nation": {"loc": [49.042909, -123.094409], "info": [{"community": "Tsawwassen First Nation", "leadership": "Chief Ken Baird (next election: April  20, 2022)", "contactPerson": "Lisa McCoy - Executive Assistant lmccoy@tsawwassenfirstnation.com", "contactInfo": "1926 TSAWWASSEN DR. N., DELTA, BC\nPostal codeV4M 4G4\nPhone(604) 943-2112", "protocol": "Sheila Williams - Senior Territory Management Coordinator swilliams@tsawwassenfirstnation.com", "about": "We’ve been here a long time. We say our people have been here “since time immemorial.” Traditional knowledge, including legends and our ancestral names, confirm our continued occupation of this area. Our land base is deeply connected to our identity. Traditionally, our resources were based on fish. Salmon, sturgeon, crab, and eulachon were our primary food resources and remain a key part of our traditional lifestyle. We still harvest salmon, crab and eulachon. Fish continues to provide for cultural and social processes that are very important to our identity, our past and our future. Traditionally, food was abundant. For centuries, we had a trade and barter system, and specialized services, such as processing of resources, were exchanged. Through our longhouse culture, we had extensive practices and ceremonies that dealt with governance functions. Our longhouse systems also ensured the redistribution of wealth to make certain our people could survive. Experts continue to learn how complex these practices were and still are.\n\nOn April 3, 2009, the Tsawwassen People ratified the first urban First Nations Treaty in B.C. It was the culmination of 14 years of negotiations. It reconciled our aboriginal rights and title and restored our right to First Nation self-government, protected in the Canadian Constitution. The Treaty provides us with municipal, provincial and federal types of jurisdiction over a land base of 724 hectares. So far, we have 23 laws that replace the Indian Act on Tsawwassen Lands and in our traditional territory. Tsawwassen First Nation also became a full member of the Metro Vancouver regional district, now Metro Vancouver, the first First Nation to do so.\n\nFor the Tsawwassen People, the Treaty has given us a cause for much hope, optimism and comfort – to know that we once again control our destiny. We are now going through a period of revival and renewal as we plan our future and seek opportunities to sustain our growth physically, economically and culturally, for present and future generations.O74", "spread": "Lower Mainland", "web": "http://tsawwassenfirstnation.com/", "map": "Tsawwassen First Nation", "srcTxt": "Aboriginal Engagement Website", "srcLnk": "http://iapps/AEWebsite/Maps/F-tsawwassenTTM.jpg\n", "pronounce": "Tah-WASS-en", "dId": "tsawwassen"}]}, "Ts'kwaylaxw(Pavillion Indian Band": {"loc": [50.883097, -121.842308], "info": [{"community": "Ts'kwaylaxw (Pavillion Indian Band)", "leadership": "Chief Justin Kane - election August 14, 2023", "contactPerson": "Chief Justin Kane justinkane24@hotmail.com", "contactInfo": "35100 Lill-Cache Ck, Lillooet, BC V0K 1V0     Office (250) 256-4204", "protocol": "", "about": "Pavilion gets its name from its gold rush-era appearance, when the chief of the Tskwaylaxw flew a large banner of white cloth which was visible to travelers up and down the canyon on the River Trail and the Old Cariboo Road (the white banner was a mark of a \"friendly Indian\" in the context of the then-recent Fraser Canyon War farther south along the Fraser, and also maybe a mark of wealth, cloth being an expensive trade good at the time).\n\nDuring the gold rush, a small boomtown emerged at Pavilion, as it was an important junction between the Old Cariboo Road, which from Pavilion climbs up over Pavilion Mountain to Cut-off Valley to Clinton, British Columbia, and the trail (soon after road) through Marble Canyon to the Bonaparte River and what would become the route of the Cariboo Road. In addition to miners' huts and packtrain encampments, by the time of the Cariboo Gold Rush lands had been alienated by settlers and the ranchhouses served as hostelries to Cariboo-bound travellers.\n\nThe ranches at Pavilion are some of the oldest land-grants in the province. The most prominent of them was staked by a Captain Martley as part of a military-officer settlement program. It has since become part of the Diamond S Ranch.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "", "map": "Ts'kwaylaxw(Pavillion Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tskwaylaxw_fcrsa_executed_1may14.pdf", "pronounce": "TS-KWHY-lux", "dId": ""}]}, "Tsleil Waututh Nation": {"loc": [49.309839, -122.980478], "info": [{"community": "Tsleil Waututh Nation", "leadership": "Chief Jennifer Thomas,July 1, 2021 to June 30, 2025.  Councillors; Deanna (Missy) George, Curtis Thomas, Dennis Thomas, Kevin O'Neil, Deanna George, Liana Martin, Charlene Aleck", "contactPerson": "Ernie George - Chief Administrative Officer cao@twnation.ca", "contactInfo": "3178 Alder Ct, North Vancouver, BC V7H 2V6         604-929-3454", "protocol": "Ernie George - Chief Administrative Officer cao@twnation.ca", "about": "Our Tsleil-Waututh Nation is one of many groups of Coast Salish peoples living in the Pacific Northwest, throughout British Columbia, Washington, and Oregon. Our knowledge of the lands and waters of our territory has shaped our people.  Our oral history tells us up to 10,000 Tsleil-Waututh members lived in our traditional territory, before contact with Europeans. Our ancestors’ survival depended on cycles of hunting, harvesting and preserving foods, and on trade with our neighbours.  Originally, our great nation was about 10,000 strong, a distinct Coast Salish nation whose territory includes Burrard Inlet and the waters draining into it.  Our people lived by a “seasonal round,” a complex cycle of food gathering and spiritual and cultural activities that formed the heart of our culture. In winter, community members congregated in large villages located in sheltered bays. Shed-roofed houses up to several hundred feet in length were divided into individual family apartments. Our people subsisted largely on stored dried foods gathered and processed throughout the rest of the year. Winter activities included wood carving, weaving blankets of mountain-goat wool, and participating in spiritual ceremonies.  See website for additional information.  twnation.ca", "spread": "Spread 7 Lower Mainland (KP 1180.1)", "web": "https://twnation.ca/", "map": "Tsleil Waututh Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tsleil-waututh_fcrsa_-_signed_apr_22_2020.pdf", "pronounce": "TSLAY-wah-tooth", "dId": "tsleil-waututh-səl̓ilwətaɂɬ"}]}, "T'Sou-ke Nation": {"loc": [48.385518, -123.696567], "info": [{"community": "T'Sou-ke Nation", "leadership": "Chief Gordan Planes - next election February 11, 2024 every 4 yrs                Councillors, Bonnie Arden, Rose Dumont", "contactPerson": "Chief Gordon Planes – gordonplanes@icloud.com      Michelle Thut, Administrator  administrator@tsoukenation.com", "contactInfo": " 2154 Lazzar Rd Sooke Ir, BC    Office: 250-642-3957", "protocol": "Michelle Thut - Administrator  administrator@tsoukenation.com", "about": "The T'sou-ke Nation of the Coast Salish peoples, is a band government whose reserve community is located on Vancouver Island. In the SENĆOŦEN language, the word T’Sou-ke is the name of the Stickleback fish that live in the estuary of the river. Exposure to Europeans through the Hudson’s Bay Company saw the name changed first to Soke and then Sooke. That English name is now common and is used for many things including the name of our neighbouring town, the river and basin, the main road. The language of the T'Sou-ke Nation is the T'Sou-ke dialect of the SENĆOŦEN (which linguists call Northern Straits Salish) of the Coast Salish languages, a subgroup of the Salishan language family. Chief Planes states, \"At one time all our people spoke the language and it was not English. It was SENĆOŦEN, the language that we share with our neighbours at Scia'new and others around Victoria and Saanich.\" No one is currently fluent in the language, but language initiatives are encouraged using current technology,[4] including online tools such as First Voices. The two T’Sou-ke reserves are on 67 hectares (165 acres) around the Sooke Basin on the Strait of Juan de Fuca. The reserves were allotted by the Joint Reserve Commission in 1877.", "spread": "Island Community ", "web": "https://www.tsoukenation.com/", "map": "T'Sou-ke Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tsou-ke_fcrsa_signed_agreement.pdf", "pronounce": "Sook", "dId": ""}]}, "Tk'emlups te Secwepemc": {"loc": [50.678844, -120.294529], "info": [{"community": "Tk'emlups te Secwepemc", "leadership": "Chief/Kukpi7  Rosanne Casimir (next election: November 11, 2021)     kukpi7.rosanne@kib.ca   250-819-2255", "contactPerson": "Councillor Thomas Blank (Natural Resources) ", "contactInfo": "200-330 Chief Alex Thomas Way\nKamloops BC, V2H 1H1           Office: (250) 828-9700", "protocol": "Jeanette Jules - Councilor/Title and Rights jeanette.jules@kib.ca", "about": "At one time the Secwepemc people occupied one large Traditional territory covering approximately 145,000 square kilometers. In 1811, after European contact, the colonial government divided the Secwepemc people into 17 distinct groups with specific parcels of land designated to each. The Kamloops Reserve land base was established in 1862 under the direction of Governor James Douglas. It is located east of the North Thompson River and north of the South Thompson River, adjacent to the City of Kamloops. The word Kamloops is the English translation of the Shuswap word Tk’emlúps, meaning ‘where the rivers meet,’ and for centuries has been the home of the Tk’emlupsemc, ‘people of the confluence.’ Tk’emlúps has always occupied a place of great economic importance in our region. Traversed by two major waterways, traditional Tk’emlupsemc territory was the center of major traffic and trade routes. Due to our community’s great economic and military strength, as well as our ancestor’s pivotal role in the creation of peace accords, the Tk’emlupsemc were designated the Secwepemc7uwi,‘ the real Shuswap’.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "https://tkemlups.ca/", "map": "Tk'emlups te Secwepemc", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/tkemlups_fcrsa_executed_sept_0916.pdf", "pronounce": "", "dId": ""}]}, "Ulkatcho (Anahim) First Nation": {"loc": [52.475488, -125.301018], "info": [{"community": "Ulkatcho (Anahim) First Nation", "leadership": "Chief Lynda Price (Next election: June 22, 2023)       Councillors;  Corrine Cahoose ccahoose@ulkatcho.ca, Rhonda Cahoose, rcahoose@ulkatcho.ca -Mabelene Leon, mleon@ulkatcho.ca Anthony Sims - santhony@ulkatcho.ca - Laurie Vaughan - lvaughan@ulkatcho.ca", "contactPerson": "chief@ulkatcho.ca", "contactInfo": "Phone: 250-742-3260         Box 3430, Anahim Lake, BC", "protocol": "Brian Johnson   bjohnson@ulkatcho.ca", "about": "The Ulkatcho First Nation is one of four communities making up the Dakelh or Southern Carrier tribal nation in central British Columbia. The other Dakelh communities are Lhoosk’us Dene, Nazko, and Lhtalo Dene (formerly Red Bluff). In earlier times before British Columbia became colonized by Euro-Canadians, Ulkatcho Village was an important potlatching and trading centre at the junction of many trading trails heading north to Chezlatta, east to the Fraser River, west to the Central Coast, and north to the Chilcotin Plateau. The village consisted of a potlatch house and several temporary brush shelters on the shore of Gatcho Lake about 80 kilometres north of Anahim Lake. There were similar potlatch houses in other parts of Ulkatcho territory. Mac Squinas said his grandfather Captain Harry Alexie told him about a potlatch house at Qualcho Lake, west of Ulkatcho Village. Theresa Holte said her elders told her about the potlatch at Nagwuntl’oo in Anahim Lake. These potlatch houses were important gathering sites for Ulkatcho people to come together to celebrate and trade.\n\nMost of the year Ulkatcho people lived in extended family groups isolated from each other as they moved about the country hunting and fishing and gathering the food and materials they needed for survival. Each family had its own fishing, hunting and trapping areas and winter quarters, usually near a lake abundant with fish. There were also a number of gathering sites throughout the territory where people came from of their remote family homes to work together to hunt, fish and preserve food for the winter. Ulkatcho families were extremely mobile and had the ability to pick up and move hundreds of kilometres across the country on very short notice when it was time to harvest the resources at a particular location. Throughout the year a family might travel from the Fraser River to the Central Coast, and from Chezlatta to the Potato Mountains in Tŝilhqot’in territory.\n\nIn the Dakelh language, Ulkatcho means “fat of the land”. This name came about because Gatcho Lake and nearby lakes were full of fish and the surrounding area was rich in game and fur bearing animals. The elders say one of the important reasons people came together at Ulkatcho Village was to hunt caribou. A large group of people was needed for the success of the hunt. They worked together to build drift fences and herd the animals into a place where they could be killed and the meat cut up. The late Chief Jimmy Stillas said all the animals in a small herd would be killed and the meat shared among the whole community.\n\nTanya Lakes, known as Taintezli or Tanyez Tezdli in the Ulkatcho dialect, was another important gathering site along the Nuxalk-Dakelh Grease Trail west of Ulkatcho Village. The large camping grounds west of Tanya Lakes known as Taintezli (where the slow water of the lake becomes the fast water of the creek) was at the fork of the grease trails to Kimsquit and Bella Coola Valley. One fork followed Takia Creek to the Dean River, Salmon House Falls and Kimsquit, and the other trail went over the Rainbow Mountains to Bella Coola. Tanya Lakes and Salmon House Falls were important salmon fishing sites in Ulkatcho territory. When the spring salmon and steelhead arrived in Takia Creek to spawn at Taintezli in August, many Ulkatcho families along with their Dakelh, Nuxalk and Tsilhqot’in neighbours camped there to catch and dry the fish. Several families had smokehouses at Taintesli. There were other smokehouses further down Takia Creek closer to where the big spring salmon were caught in the river, and smokehouses at Salmon House Falls on the Dean River. These gatherings like the one at Taintesli were important social times. Traditional games like lahal and other competitions like running races, horseback races, wrestling matches, spear-throwing and shooting contests were held. Lahal was a serious gambling game and Chief Jimmy Stillas said sometimes a person lost their horse in a lahal game and had to walk home.\n\nUlkatcho people have family ties with neighbouring Dakelh communities of Chezlatta, Lhoosk’us Dene, Lhtalo Dene (Red Bluff) and Nazko. Also a significant number of Ulkatcho families are related to the Tŝilhqot’in and Nuxalk as well. One of the names given to the the Ulkatchot’en by their Dakelh neighbours was Nechowt’en which means “Dakelh people mixed with Tŝilhqot’in”. O82Famous Nuxalk game guide and grizzly bear hunter Clayton Mack, whose first wife, Cecelia “Doll” Capoose, was an Ulkatcho woman from Abuntlet, once described Anahim Lake as the place where Indigenous people from different backgrounds “mixed and lived”. This diversity can be seen as one of the strengths of the Ulkatcho community. Ulkatchot’en people embrace many traditions and points of view and develop their own unique cultural perspective from these choices.", "spread": "Spread 3 (KP 489 to 610) ", "web": "https://www.ulkatcho.ca/", "map": "Ulkatcho (Anahim) First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/ulkatcho_fcrsa_signed_april_25_2019.pdf", "pronounce": "Ul-gat-cho", "dId": ""}]}, "Union Bar First Nation": {"loc": [49.210913, -121.240262], "info": [{"community": "Union Bar First Nations", "leadership": "Chief Andrew (Andy) Alex (appointed in 1977)", "contactPerson": "Tammy Shields - Chief Administrative Officer tammyshields12@gmail.com", "contactInfo": "Phone: 604-869-9930      Box 788, Hope, BC", "protocol": "Joshua Currie - Referrals joshuacurrie1245@gmail.com", "about": "", "spread": "", "web": "", "map": "Union Bar First Nation", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/union_bar_february_2_2021_1.pdf", "pronounce": "", "dId": ""}]}, "Upper Nicola Indian Band": {"loc": [50.167239, -120.283533], "info": [{"community": "Upper Nicola Indian Band", "leadership": "Chief Harvey McLeod (Next election: March 22, 2023)", "contactPerson": "Chief Harvey McLeod chief@uppernicola.com", "contactInfo": "Phone: 250-350-3342", "protocol": "", "about": "Upper Nicola is the only Syilx (Okanagan) community in the Nicola Valley. In the 18th century, ancestors of Upper Nicola permanently inhabited the Upper Nicola and Salmon River watersheds as a result of the Fish Lake Accord with the Kamloops Shuswap tribe. The agreement was made in the late 1700s between the Chiefs of the T’kemlups Secwepemc and the Syilx to end wars between these two communities, where the Syilx were granted the former Secwepemc territory in the vicinity of Douglas Lake. We have traditionally shared this region with our Nlaka’pamux neighbours, the Interior Salish Nation that inhabited the Thompson River region to the south. Our alliances, exchanges, and intermarriages with our neighbours over the centuries have made us a strong and diverse community. Before European colonization brought about the removal of our people from our traditional settlements, we lived in villages ranging in size from just a few families to several hundred residents. Village and band autonomy were strongly valued, and chiefs were recognized on the basis of achievement or heredity. We actively pursued peaceful means in resolving issues between groups and placed great weight on qualities of modesty and respect. We were stewards of the lands and waters that nourished us and treated them with reverence. We took only what was needed and were experts in the uses of plants and animals. We were careful stewards of our environment, using regular controlled burning to clear brush and produce abundant berries and roots for harvesting. Water is revered as sacred and is part of creation stories, teaching and laws in Upper Nicola/Syilx spirituality, and must be treated with respect and dignity.\n\nToday, many of us still carry out traditional activities, particularly berry and mushroom picking, fishing, and hunting within our traditional territory. While fewer of us participate in spiritual and ceremonial practices, many of us are working to keep our language and the root of our culture alive and well.", "spread": "Spread 4 (KP 610 to 764)     ", "web": "http://uppernicola.com/", "map": "Upper Nicola Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/forestry-agreements/upper_nicola_ftoa_feb11.pdf", "pronounce": "", "dId": ""}]}, "Upper Similkameen Indian Band": {"loc": [49.462883, -120.50172], "info": [{"community": "Upper Similkameen Indian Band", "leadership": "Chief Bonnie Jacobsen (Next election: March 2, 2022)", "contactPerson": "referrals@usib.ca", "contactInfo": "Phone: 250-292-8733", "protocol": "referrals@usib.ca", "about": "Oral tradition tells us that the Upper Similkameen people have lived in this valley since time immemorial.  Our people live along the banks of the Similkameen and its tributaries. Our traditional territory is located in the Upper Similkameen watershed between the US-Canada border (to the south), the Skagit Valley (to the west), and Aspen Grove (to the north).\n\nFor thousands of years, we the Similkameen people were self-reliant and well provided for through our own ingenuity and use of the land and resources. We lived as a whole economy, travelling the breadth and depth of our territory; hunting, fishing, growing, harvesting, and trading created a sustainable economy that met our needs.\n\nToday the Similkameen People continue to assert their jurisdiction and responsibility over the stewarding of their land, resources, and quality of life of their citizens. Our nsyilxcən language and our saimilamix culture respectfully honour the natural laws of the tmixw – that which gives us life.\n\nOur name for the Hedley area is Snaza’ist (sna-za-ee-st), meaning striped rock place but there is more to it than just a name.  Our elders tell us that chipmunk was teasing sasquatch and, in his quest, to get back at the chipmunk he kept swiping at the rocks, causing the stripes.  Sasquatch finally got the chipmunk and that is why the chipmunk also has stripes like the rocks.\n\nWhen all the animals got along chipmunk used to tease sasquatch all the time. One day chipmunk was teasing sasquatch, climbing all over him up and down, and he bit him. Sasquatch went blind with rage and anger at the chipmunk for biting him, he went to catch him but ended up scratching the chipmunk along his back, making him bleed. Sasquatch felt bad for scratching the chipmunk, seeing him hurt and bleeding he wanted to help, but the chipmunk was frightened from now.\n\nSasquatch chased the chipmunk all over the mountain sides trying to help, but the chipmunk was too fast for sasquatch and didn’t want to be caught.  The Chipmunk was running and jumping all over the mountain sides in fear of being caught leaving his trails of blood O85as he got away. The Chipmunks blood trails created the stripes in the mountains of Hedley and this is the story of how the chipmunk got his stripes on his back from sasquatch.", "spread": "Thompson Okanagan - Spread F", "web": "https://usib.ca/", "map": "Upper Similkameen Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/upper_similkameen_signed_fcrsa_september_2019_signed_by_msf.pdf", "pronounce": "Si-MIL-kuh-meen", "dId": ""}]}, "Whispering Pines(Clinton) Indian Band": {"loc": [51.194286, -121.613314], "info": [{"community": "Whispering Pines/Clinton Indian Bands", "leadership": "Chief Michael LeBourdais (Next election: February 4, 2022) ", "contactPerson": "Ed LeBourdais - Councilor ed.lebourdais@wpcib.com   45855 Promontory Road, Chilliwack, BC", "contactInfo": "Phone: 250-579-5772", "protocol": "Ed LeBourdais - Councilor ed.lebourdais@wpcib.com", "about": "The Whispering Pines / Clinton Indian Band was formerly known as the Clinton Band. The WP/CIB are known as the Pelltiq't People and are part of the Shuswap Nation Tribal Council. Our Logo is a great representation of the Pelltiq't People, our great ancestors who held animal powers inherited from generation to generation from the great creator.\n\nSince time immemorial our ancestors lived in harmony with mother earth. We took from mother what we needed to survive. We cared for and nurtured our lands. We defended our Traditional Territory from outside invaders our Coyote Rock stands as a Sentry Guardian and Protecting our Territory. ", "spread": "Spread 6 ", "web": "https://www.wpcib.com/", "map": "Whispering Pines(Clinton) Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/whispering_pine_fcrsa_executed_march_2917.pdf", "pronounce": "", "dId": ""}]}, "Williams Lake Indian Band": {"loc": [52.10532, -121.9905], "info": [{"community": "Williams Lake Indian Band", "leadership": "Chief Willie Sellars (Next election: August 25, 2022)", "contactPerson": "", "contactInfo": "Phone: 250-296-3507", "protocol": "", "about": "In the Shuswap language, Williams Lake is T'exelc. The T’exelcemc, or Williams Lake First Nation (WLFN), is a member of the Secwepemc Nation (Shuswap people) located in the central interior of British Columbia. In 1838, Fort Alexandria took a census of WFLN’s population and recorded 309 souls at WLFN’s Chimney Creek village site, now Indian Reserve # 5. The 1862-63 smallpox epidemic decimated WFN’s population by two-thirds. James Teit estimated WLFN’s population at 100 members in 1909. As of April 2021, our membership has recovered to 857 band members with 235 members currently living on reserve and 578 living off reserve and 43 living in other First Nations Communities.\n\nWLFN is a thriving Secwepemc community. The Nation’s mandate and mission is to become a healthy and prosperous community and continue to develop effective governance. While in stage 5 of the BCTC Treaty Process, WLFN is in the process of transitioning away from the Indian Act. Since 1991, WLFN has developed its own Membership Code (1991), Custom Election Code (2007). WLFN is presently governed by the WLFN Land Management Code (2016) and the WLFN Financial Administration Law (2018). WLFN has been International Standard Organization (ISO) certified since 2008.\n\nSince the mid 1990s WLFN has been an economic opportunity driver in the Central Cariboo, the main enterprises owned and operated by WLFN include UNITY Cannabis, Sugar Cane Cannabis, Sugar Cane Petroleum Products, Sugar Cane Archeology, Chief Will-yum Campsite, Coyote Rock Real Estate Development, Coyote Rock Golf Course, and Borland Creek Logging. These enterprises do not only serve WLFN’s on and off-reserve members but the general public and tourists passing through our community.", "spread": "", "web": "https://williamslakeband.ca/", "map": "Williams Lake Indian Band", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/williams_lake_ib_fcrsa_executed_jan_112017.pdf", "pronounce": "", "dId": ""}]}, "Yale First Nation": {"loc": [49.492718, -121.423097], "info": [{"community": "Yale First Nation ", "leadership": "Chief Ken Hansen (Next election: September 6, 2023)", "contactPerson": "Chief Ken Hansen khansen@yalefirstnation.ca\n", "contactInfo": "Phone: 604-869-0013         Box 1869, Hope, BC  ", "protocol": "Steve Patterson - Lands/Resources and Economic Development spatterson@yalefirstnation.ca", "about": "Yale First Nation (YFN) is a small progressive First Nation Community situated on the #7 and #1 Highways. YFN territory begins in the Fraser Valley and runs along the Fraser River to the beginning of the Fraser Canyon. Geographically it starts 18 km from downtown Agassiz, and occurs sporadically along the highways until you reach Yale BC 33 km later. It consists of sixteen parcels of reserve land, four of which are distinct and separate residential communities which are currently occupied by fifty nine (59) of the total 176 registered community members, and the remaining twelve consist of many kilometres of uninhabitable rocky-river front, mountain side and privately owned commercial ventures.\n\nIn 2013 the community elected a new Chief and leadership team after 30 years. The transition from old to new required a physical move taking the administration off reserve and into the community of Hope situated approximately midway between the residential communities identifying a central location on which to establish a government office. \n\nAccording to the INAC website there are no population statistics available for YFN prior to 2011. The 2011 statistics state that there were a total population of 90.  60 of whom were registered Indians, and that the median age was 49.5 years of age.  Our current membership list ( 2017)  identifies 166 members; 65 living on reserve and 101 living off. 35% of the population is between ages 25 and 50, and 23% are over 50. This aging population and lack of births indicates the challenges that are coming for YFN in health and supportive care; No youth to take up the care of the elders, no youth to bring economic stability to the community, no youth to lead the community through the coming years. Without the influx of children and youth the community elders have no one to pass along the stories and history, and without the ability to pass along the traditional knowledge the community suffers from uncertainty regarding the future and our capacity to retain our culture and traditional knowledge.", "spread": "Spread 5 (KP 806 to 1075)", "web": "https://www.yalefirstnation.ca/", "map": "Yale First Nation", "srcTxt": "", "srcLnk": "", "pronounce": "", "dId": ""}]}, "Xat'sull First Nation (Soda Creek)": {"loc": [52.854978, -121.585666], "info": [{"community": "Xat'sull First Nation (Soda Creek)", "leadership": "Chief Sherri Sellars - term every 4 yrs, next election March 25, 2023\nCouncil Kelly Sellars\nCouncil Crystal Harry\nCouncil Mike Stinson\nCouncil Marni Sellars", "contactPerson": "Howard Campbell - Interim CEO howard.campbell@xatsulldevelopment.com", "contactInfo": "Office: (250) 989-2323                 3405 Mountain House Road, Williams Lake BC", "protocol": "office: ((250) 989-2323  ", "about": "Xatśūll First Nation is an Indigenous community located on the edge of the Fraser River just north of Williams Lake, British Columbia. Xatśūll First Nation consists of over 400 members who are a part of a larger group of British Columbia’s Interior Salish people known as the Secwepemc. The Interior Salish occupy the south central region of the Province and are comprised of four separate nations known as the St’at’imc (Lillooet), Nlaka’pamux (Thompson), Siylx (Okanagan) and Secwepemc (Shuswap). The Secwepemc Nation is the largest and northernmost Interior Salish group. They have occupied the region for thousands of years prior to European settlement. The vast traditional territory of the Secwepemc people extended from the Rocky Mountains in the East through the Columbia River valley to the west of the Fraser River area and the Southern Arrow Lakes region to the Northern McBride area. The Secwepemc Nation was traditionally a self-governing people who were united by Secwepemctsin language, culture and belief system; however the bands were operated separate and independent from each other. Yet the nation worked together as a political alliance that regulated use of the land and resources, and protected their territories. The Xatśūll First Nation is the most northerly Secwepemc community in this vast region and has occupied this village site for at least 5,000 years. For thousands of years the Northern Secwepemc have occupied and utilized large areas of the northern territory extending East of Mt. Alex Graham going North East to Bowen Lake areas including areas around Quesnel Lake and Horsefly.\n ", "spread": "Spread 4 (KP 610 to 764)     ", "web": "http://xatsull.com/", "map": "Xat'sull First Nation (Soda Creek)", "srcTxt": "BC Forestry Agreement Website", "srcLnk": "https://www2.gov.bc.ca/assets/gov/environment/natural-resource-stewardship/consulting-with-first-nations/agreements/xatsull_fcrsa_finalized_june_11_2019.pdf", "pronounce": "", "dId": ""}]}}